pico-8 cartridge // http://www.pico-8.com
version 42
__lua__
function _init()
	tmr=0
	ini_fx()
	ini_menu()
end

function _update60()
	_upd()
end

function _draw()
	_drw()
	drw_animations()
end

-----------------
-- ini
-----------------
function ini_game()
	resetdev()
	
	hp=20
	maxhp=20
	
	bgx,bgy=0,20
	
	cursel=1
	oldcursel=1
	
	ini_deck()
	
	room=1
	roomcol={1,1,1,2,2,2,3,3,3,5,5,5,4,4,11,11,8,8,9,9,13,13,12,12,10,10}
	hasrun=false
	
	
	--animations
	wpnattached=false
	bleed,heal=0,0
	async(deckani)
	
	_upd=upd_game
	_drw=drw_game
	
end

function ini_deck()
	deck={}
	deckcopy={}
	shfdeck={}
	shfdeckcopy={}
	hand={}
	suits={"hrt","dmd","clb","spd"}
	discards={}
	
	cardpos={
		{x=10,y=8},
		{x=52,y=8},
		{x=10,y=46},
		{x=52,y=46},
		{x=84,y=40}
	}
	
	--create deck
	mk_deck()
	--remove face cards (red)
	rm_faces()
	--make a copy / keep orig
	copy(deck,deckcopy)
	-- shuffle copy (a) into new 
	-- deck (b)
	-- del orig copy (a)
	shuffle(deckcopy,shfdeck)
	--make a copy of deck (b)
	--into new deck (c)
	copy(shfdeck,shfdeckcopy)
	
	
	dealcards(4)
end

function ini_menu()
	_upd=upd_menu
	_drw=drw_menu
end

function ini_cut1()
	resetdev()
	_upd=upd_cut1
	_drw=drw_cut1
end


-->8
--draws
function drw_menu()
	fadepal((100-develop)/100)
	cls()
	?menu,0,0
	
	?"THESAILOR_DEV",2,2,9
end

function drw_cut1()
	fadepal((100-develop)/100)
	cls()
	?hallway,0,0
end

function drw_gameover()
	fadepal((100-develop)/100)
	cls()
	?dead,0,0
end

function drw_game()
	fadepal((100-develop)/100)
	
	cls()
	
	drw_bkg()
	drw_hline(0,82,5)
	drw_vline(60,82,5)
	drw_healthbar()
	
		
		
		drw_weapon(70,90,83,88)
		drw_flee()
		if allgame==true then
			drw_deck(10,88)
			drw_hand()
			drw_cursor()
		end
		
		if cursel!=5 and #routines==0 then
			drw_icos(cardpos[cursel].x,
													cardpos[cursel].y,
													hand[cursel])
		end
			
		
	drw_frame()
end

function drw_bkg()
	fillp(…)
	circfill(bgx+sin(time()*8)*.2,bgy,34,1)
	circfill(127+bgx+sin(time()*8)*.2,bgy,34,1)
	fillp(░)
	circfill(30+bgx+sin(time()*8)*.2,bgy,34,1)
	circfill(90+bgx+sin(time()*8)*.2,bgy,34,1)
	circfill(60+bgx+sin(time()/8)*7,bgy-20,22,2)
	circfill(20+bgx+sin(time()/8)*12,bgy-20,22,2)
	circfill(80+bgx+sin(time()/8)*12,bgy-20,22,2)
	fillp(▒)
	circfill(110+bgx+sin(time()/8)*12,bgy-20,22,2)
	circfill(110+bgx+sin(time()/8)*7,bgy-20,14,4)
	circfill(10+bgx+sin(time()/8)*7,bgy-20,14,4)
	fillp()
end

function drw_hline(_x1,_y1,_c)
	for i=1,127 do
		if i%4==0 then 
			pset(_x1+i,_y1,_c)
		end
	end
end

function drw_vline(_x1,_y1,_c)
	for i=1,127 do
		if i%4==0 then 
			pset(_x1,_y1+i,_c)
		end
	end
end

function drw_healthbar()
	? "hp",93,11,0
	? "hp",94,11,0
	? "hp",93,10,7
	? hp,113,11,0
	? hp,114,11,0
	? hp,113,10,7
	line(100,14,111,14,13)
	
	local newx=94
	local newy=12
	for i=0,maxhp-1 do
		if i%4==0 then
			newx=94
			newy+=6
		end
		
		? "♥",newx,newy,13
		newx+=6
	end
	
	local newx=94
	local newy=12
	for i=0,hp-1 do
		if i%4==0 then
			newx=94
			newy+=6
		end
		
		palt(7,true)
		sspr(119,0,6,5,newx+1,newy)
		palt()
		newx+=6
	end
end

function drw_deck(_x,_y)
	drw_bcard(_x,_y)
	? "_..",_x+36,(_y+22)-(room*2),roomcol[room]
	? #shfdeckcopy,_x+36,(_y+28)-(room*2),roomcol[room]
	? "_..",_x+36,(_y+30)-(room*2),roomcol[room]
--	? "room:"..room,_x+8,_y+26,7
end

function drw_bcard(_x,_y)
	rectfill(_x+1,_y-1,_x+30,_y+31,1)
	rectfill(_x,_y,_x+31,_y+30,1)
	
	pset(_x,_y-1,6)
	pset(_x+31,_y-1,12)
	pset(_x,_y+31,5)
	pset(_x+31,_y+31,5)
	
	line(_x+1,_y-2,_x+20,_y-2,6)
	line(_x+21,_y-2,_x+30,_y-2,12)
	
	line(_x-1,_y,_x-1,_y+12,6)
	line(_x-1,_y+12,_x-1,_y+24,12)
	line(_x-1,_y+24,_x-1,_y+30,5)
	
	line(_x+32,_y,_x+32,_y+12,12)
	line(_x+32,_y+12,_x+32,_y+24,13)
	line(_x+32,_y+24,_x+32,_y+30,5)
	
	line(_x+1,_y+32,_x+30,_y+32,5)
	
	fillp(▒)
	rectfill(_x,_y+23,_x+31,_y+26,0)
	fillp()
	
	rectfill(_x,_y+26,_x+31,_y+30,0)
	line(_x+1,_y+31,_x+30,_y+31,0)
	
	
	? "sco",_x+4,_y+4,6
	? "und",_x+4,_y+10,6
	? "rel",_x+4,_y+16,6
end

function drw_fcard(_x,_y,_rank,_suit)
	local c1,c2,c3,c4,c5=8,7,14,8,14
	if _suit=="spd" or
				_suit=="clb" then
				c1=0
				c2=9
				c3=13
				c4=5
				c5=5
	end
	
	rectfill(_x+1,_y-1,_x+30,_y+31,7)
	rectfill(_x,_y,_x+31,_y+30,7)
	
	pset(_x,_y-1,10)
	pset(_x+31,_y-1,9)
	pset(_x,_y+31,13)
	pset(_x+31,_y+31,13)
	
	line(_x+1,_y-2,_x+20,_y-2,10)
	line(_x+21,_y-2,_x+30,_y-2,9)
	
	line(_x-1,_y,_x-1,_y+12,10)
	line(_x-1,_y+12,_x-1,_y+24,9)
	line(_x-1,_y+24,_x-1,_y+30,13)
	
	line(_x+32,_y,_x+32,_y+12,9)
	line(_x+32,_y+12,_x+32,_y+24,4)
	line(_x+32,_y+24,_x+32,_y+30,13)
	
	line(_x+1,_y+32,_x+30,_y+32,13)
	
	fillp(…)
	rectfill(_x,_y+23,_x+31,_y+27,6)
	fillp(▒)
	rectfill(_x,_y+28,_x+31,_y+30,6)
	fillp()
	
	line(_x+1,_y+31,_x+30,_y+31,6)
	
	rectfill(_x+1,_y+6,_x+5,_y+29,c3)
	line(_x+1,_y+30,_x+5,_y+30,c4)
	line(_x+2,_y+31,_x+4,_y+31,c4)
	line(_x+3,_y+32,_x+3,_y+32,c4)
	pset(_x+1,_y+31,1)
	pset(_x+2,_y+32,1)
	pset(_x+5,_y+31,1)
	pset(_x+4,_y+32,1)
	
	for i=1,#_suit do
		? _suit[i],_x+2,_y+7+((i-1)*6),7
	end
	
	line(_x+1,_y-2,_x+9,_y-2,c5)
	
	palt(0,false)
	palt(7,true)
	if _suit=="spd" or 
				_suit=="clb" then
		if _rank==14 then
			sspr(72,0,23,27,_x+9,_y+4)
		elseif _rank==13 then
			sspr(24,0,23,27,_x+9,_y+4)
		elseif _rank==12 then
			sspr(95,0,23,27,_x+9,_y+4)
		elseif _rank==11 then
			sspr(0,29,23,27,_x+9,_y+4)
		elseif _rank==10 or 
									_rank==9 or
									_rank==8 or 
									_rank==7 or
									_rank==6 then
			sspr(0,0,23,27,_x+9,_y+4)
		elseif _rank==5 or
									_rank==4 or
									_rank==3 or
									_rank==2 then
			sspr(48,0,23,27,_x+9,_y+4 )
		end
	end
	if _suit=="dmd" then
		if _rank==10 or
					_rank==9 or
					_rank==8 then
			sspr(84,29,23,27,_x+9,_y+4)
		elseif _rank==7 or
									_rank==6 or
									_rank==5 or
									_rank==4 then
			sspr(65,29,18,28,_x+11,_y+2)
		elseif _rank==3 or
									_rank==2 then
			sspr(45,29,18,28,_x+11,_y+2)
		end
	end
	if _suit=="hrt" then
		if _rank>5 then
			sspr(22,58,20,30,_x+8,_y+1)
		else
			sspr(0,58,20,30,_x+8,_y+1)
		end
	end
	palt()
	
	rectfill(_x+1,_y-1,_x+9,_y+5,c1)
	local newrank
	if _rank<10 then
		? _rank,_x+4,_y,c2
	elseif _rank==10 then
		? _rank,_x+2,_y,c2
	else
		if (_rank==11) newrank="j"
		if (_rank==12) newrank="q"
		if (_rank==13) newrank="k"
		if (_rank==14) newrank="a"
		? newrank,_x+4,_y,c2
	end
end

function drw_hand()
	if #discards==0 then
		for i=1,#hand do
			drw_fcard(
				cardpos[i].x,
				cardpos[i].y,
				hand[i].rank,
				hand[i].suit
				)
		end
	end
end

function drw_flee()
	if hasrun==false and #hand==4 then
		rect(
			cardpos[5].x+10,
			cardpos[5].y+13,
			cardpos[5].x+10+22,
			cardpos[5].y+13+18,
			1)
		
		? "flee",cardpos[5].x+14,cardpos[5].y+16,12
		? "room",cardpos[5].x+14,cardpos[5].y+24,12
	end
end

function drw_cursor()
	local movey=sin(time()/1.5)*0.8
	palt(0,false)
	palt(7,true)
	sspr(
		24,27,
		21,22
		,cardpos[cursel].x+22,
		cardpos[cursel].y+20+movey
		)
	palt()
end

function drw_weapon(_x1,_y1,_x2,_y2)
	if hasweapon!=nil and
				wpnattached==true then
		drw_fcard(_x1,_y1,hasweapon.lmt,hasweapon.lmtsuit)
		line(81,88,81,118,0)
		pset(82,119,0)
		pset(83,120,0)
		line(84,121,101,121,0)
		drw_fcard(_x2,_y2,hasweapon.rank,hasweapon.suit)
	end
end

function drw_icos(_x,_y,_tbl)
	
	if _tbl.suit=="spd" or
				_tbl.suit=="clb" then
		
		if hasweapon then
			if _tbl.rank<=hasweapon.lmt then
				rectfill(
					_x,_y+13,
					_x+16,_y+19,4
				)
				line(_x,_y+20,_x+16,_y+20,1)
				? "wpn",_x+5,_y+14,10
				palt(7,true)
				pal(2,4)
				sspr(119,5,6,7,_x-3,_y+13)
			end
		end
		
		rectfill(
			_x,_y+22,
			_x+20,_y+28,4
		)
		line(_x,_y+29,_x+19,_y+29,1)
		? "fist",_x+5,_y+23,10
		palt(7,true)
		pal(2,4)
		sspr(119,12,6,7,_x-3,_y+22)
		pal()
	elseif _tbl.suit=="hrt" then
		rectfill(
			_x,_y+22,
			_x+16,_y+28,2
		)
		line(_x,_y+29,_x+16,_y+29,1)
		? "use",_x+5,_y+23,14
		
		palt(7,true)
		pal(9,2)
		sspr(119,12,6,7,_x-3,_y+22)
		pal()
	elseif _tbl.suit=="dmd" then
		rectfill(
			_x,_y+22,
			_x+16,_y+28,3
		)
		line(_x,_y+29,_x+16,_y+29,1)
		? "pck",_x+5,_y+23,11
		
		palt(7,true)
		pal(2,3)
		sspr(119,12,6,7,_x-3,_y+22)
		pal()
	end
end

function drw_frame()
	for i=0,2 do
		rect(0+i,0+i,127-i,127-i,6)
	end
end

function drw_animations()
	for r in all(routines) do
		if costatus(r)=="dead" then
			del(routines,r)
		else
			coresume(r)
		end
	end
end
-->8
--updates
function upd_menu()
	fadeeff(.17)
	if (btnp(❎)) ini_cut1()
end

function upd_cut1()
	fadeeff(.06)
	if (btnp(❎)) ini_game()
end

function upd_gameover()
	fadeeff(.1)
	
	
	
	if develop==100 then
		if tmr>0 then
			tmr-=1
		else
			async(statsboard)
		end
	end
end

function upd_game()
	fadeeff(.2)
	if develop==100 and #routines==0 then
		upd_cursor()
		upd_cards()
	end
end

function upd_cursor()
	local current=cursel
	
	if (btnp(➡️)) cursel+=1
	if (btnp(⬅️)) cursel-=1
	
	local n
	if (#hand<4) n=#hand
	if (#hand==4) n=5
	if (#hand==4 and hasrun==true) n=4
	
	--actions
	if btnp(❎) then
		if cursel==5 and #hand==4 then
			--flee room
			if (hasrun==false) flee()
		elseif hand[cursel].suit=="spd" or
			hand[cursel].suit=="clb" then
			--punch with fists
			atkpunch()
		elseif hand[cursel].suit=="hrt" then
			--drink potion
			usepotion()
		elseif hand[cursel].suit=="dmd" then
			--take weapon
			pckweapon()
		end
	end
	
	if btnp(🅾️) and hasweapon then
		if hand[cursel].suit=="clb" or
					hand[cursel].suit=="spd" then
			if hasweapon.lmt>=hand[cursel].rank then
				async(cardslide)
				atkstab()
			else
				sfx(53)
			end
		end
	end
	
	cursel=mid(1,cursel,n)
	
	if current!=cursel then
		sfx(63)
	end
	
end

function upd_cards()
	if #hand==1 and #routines==0 then
		sfx(52)
		room+=1
		hasrun=false
		totcards=3
		async(hidehand)
	end
end
-->8
--effects
function ini_fx()
	routines={}
	shake=0
	develop=0
	devspeed=0
end

function fadepal(_perc)
 local p=flr(mid(0,_perc,1)*100)
 local kmax,col,dpal,j,k
 dpal={0,1,1,2,1,13,
 						6,4,4,9,3,13,
 						1,13,14}
 
 for j=1,15 do
  col = j
  kmax=(p+(j*1.46))/22
  
  for k=1,kmax do
   col=dpal[col]
  end
  
  pal(j,col)
 end
end

function fadeeff(n)
	if develop<100 then
		devspeed+=n
		develop+=devspeed
	end
	develop=min(100,develop)
end

function resetdev()
	devspeed=0
	develop=0
end
-->8
--cards
function mk_deck()
	for s=1,4 do
		for r=2,14 do
			add(deck,{
				remcard=false,
				suit=suits[s],
				rank=r
			})
		end
	end
end

function rm_faces()
	for c in all(deck) do
		if c.suit=="hrt" or
					c.suit=="dmd" then
						if c.rank>10 then
							del(deck,c)
						end
		end
	end
end

function copy(tbl1,tbl2)
	for c=1,#tbl1 do
		--copy deck into deckcopy
		add(tbl2,tbl1[c])
	end
end

function shuffle(tbl1,tbl2) 
	for r=1,#tbl1 do
		local randcard=1+flr(rnd(#tbl1))
		add(tbl2,tbl1[randcard])
		deli(tbl1,randcard)
	end
end

function dealcards(v)
	for i=1,v do
		add(hand,shfdeckcopy[1])
		deli(shfdeckcopy,1)
	end
end

function discard(c)
	deli(hand,c)
end

function usepotion()
	sfx(59)
	mk_discard(cursel)
	heal=hand[cursel].rank
	async(gethp)
	if (hp>maxhp) hp=maxhp
	discard(cursel)
	cursel=1
end

function pckweapon()
	sfx(62)
	hasweapon=hand[cursel]
	hasweapon.x=cardpos[cursel].x
	hasweapon.y=cardpos[cursel].y
	hasweapon.lmt=14
	hasweapon.lmtsuit="clb"
	wpnattached=false
	async(cardslide)
	discard(cursel)
	cursel=1
end

function atkpunch()
	sfx(61)
	bleed=hand[cursel].rank
			async(redflash)
			async(loshp)
			mk_discard(cursel)
			discard(cursel)
	cursel=1
end

function atkstab()
	if hasweapon then
		--weapon lmt
		if hasweapon.lmt>=hand[cursel].rank then
			--calc dmg
			if hand[cursel].rank>hasweapon.rank then
				dmg=hand[cursel].rank-hasweapon.rank
			else
				dmg=0
			end
			sfx(55)
			if (dmg<0) dmg*=-1
			bleed=dmg
			async(redflash)
			async(loshp)
			oldcursel=cursel
			mk_discard(cursel)
			async(monsterlmt)
			hasweapon.lmt=hand[cursel].rank
			discard(cursel)
		end
	end
	cursel=1
end

function flee()
	sfx(58)
	
	--copy hand back into bottom
	-- of the deck
	for i=#hand,1,-1 do
			add(shfdeckcopy,hand[i])
			deli(hand,i)
	end
	
	hasrun=true
	cursel=1
	
	--pull new hand
	totcards=4
	async(hidehand)
	
end

-->8
--animations
function async(_func)
	add(routines,cocreate(_func))
end

function wait(f)
	local f=f or 90
	for i=1,f do
		yield()
	end
end

function deckani()
	local oy,yy=-20,0
	local c=0
	local cnt=0
	
	wait(40)
	for i=1,30 do
		drw_bcard(10+cos(time()*12),88)
		c+=1.3
		cnt=c%44
		? flr(1+cnt),46,117,12
		
		if oy+yy>60 then
			oy=10
			yy=0
		else
			yy+=20
			sfx(58)
		end
		drw_bcard(10+(cos(time()*33)*2),oy+yy)
		yield()
	end
	totcards=4
	async(carddeal)
	wait(38)
	wpnattached=true
	allgame=true
end

function carddeal()
local fr=40
local _x1,_x2,_x3,_x4=10,10,10,10
local _y1,_y2,_y3,_y4=88,88,88,88
local cnt
	for i=1,fr do
		
		drw_deck(10,88)
	
	if totcards==4 then
		_x4=lerp(_x4,cardpos[4].x,easeinovershoot(i/30))
		_y4=lerp(_y4,cardpos[4].y,easeinovershoot(i/30))
		drw_bcard(_x4,_y4)

		_x3=lerp(_x3,cardpos[3].x,easeinovershoot(i/30))
		_y3=lerp(_y3,cardpos[3].y,easeinovershoot(i/30))
		drw_bcard(_x3,_y3)

		_x2=lerp(_x2,cardpos[2].x,easeinovershoot(i/20))
		_y2=lerp(_y2,cardpos[2].y,easeinovershoot(i/20))
		drw_bcard(_x2,_y2)

		_x1=lerp(_x1,cardpos[1].x,easeinovershoot(i/20))
		_y1=lerp(_y1,cardpos[1].y,easeinovershoot(i/20))
		drw_bcard(_x1,_y1)
	end
	
		if totcards==3 then
			drw_fcard(cardpos[1].x,cardpos[1].y,hand[1].rank,hand[1].suit)
		
		
		_x4=lerp(_x4,cardpos[4].x,easeinovershoot(i/30))
		_y4=lerp(_y4,cardpos[4].y,easeinovershoot(i/30))
		drw_bcard(_x4,_y4)

		_x3=lerp(_x3,cardpos[3].x,easeinovershoot(i/30))
		_y3=lerp(_y3,cardpos[3].y,easeinovershoot(i/30))
		drw_bcard(_x3,_y3)

		_x2=lerp(_x2,cardpos[2].x,easeinovershoot(i/20))
		_y2=lerp(_y2,cardpos[2].y,easeinovershoot(i/20))
		drw_bcard(_x2,_y2)
	end
	
		if totcards==2 then
			drw_fcard(cardpos[1].x,cardpos[1].y,hand[1].rank,hand[1].suit)
		
		_x3=lerp(_x3,cardpos[3].x,easeinovershoot(i/30))
		_y3=lerp(_y3,cardpos[3].y,easeinovershoot(i/30))
		drw_bcard(_x3,_y3)

		_x2=lerp(_x2,cardpos[2].x,easeinovershoot(i/20))
		_y2=lerp(_y2,cardpos[2].y,easeinovershoot(i/20))
		drw_bcard(_x2,_y2)
		end
	
		if totcards==1 then
			drw_fcard(cardpos[1].x,cardpos[1].y,hand[1].rank,hand[1].suit)
		
		_x2=lerp(_x2,cardpos[2].x,easeinovershoot(i/20))
		_y2=lerp(_y2,cardpos[2].y,easeinovershoot(i/20))
		drw_bcard(_x2,_y2)
		end
		yield()
	end
	for i=1,4 do
		sfx(51)
	end
end

function cardslide()
local _x,_y=-20,128
local cnt
	for i=1,30 do
		hasweapon.x=lerp(hasweapon.x,83,easeinovershoot(i/30))
		hasweapon.y=lerp(hasweapon.y,88,easeinovershoot(i/30))
		drw_deck(10,88)
		drw_hand()
		drw_weapon(70,90,83,88)
		drw_flee()
		drw_cursor()
		drw_fcard(hasweapon.x,hasweapon.y,hasweapon.rank,hasweapon.suit)
		
		yield()
	end
	wpnattached=true
end

function discardani()
	local randx=rnd({-90,-60,-30,0,30,60,90})
	for i=1,40 do
		discards.x=lerp(
			discards.x,randx,
			easeinovershoot(i/30))
		discards.y=lerp(
			discards.y,-32,
			easeinovershoot(i/30))
		
		drw_deck(10,88)
		drw_hand()
		drw_weapon(70,90,83,88)
		drw_flee()
		drw_cursor()
		
		drw_fcard(
			discards.x,
			discards.y,
			discards.rank,
			discards.suit
			)
		yield()
	end
	discards={}
end

function mk_discard(c)
	discards.rank=hand[c].rank
	discards.suit=hand[c].suit
	discards.x=cardpos[c].x
	discards.y=cardpos[c].y
	async(discardani)
end

function redflash()
	for i=1,3 do
		cls(8)
		cls(2)
		circfill(
			handpos[oldcursel].x+12,
			handpos[oldcursel].y+12,
			9,15
		)
		yield()
	end
end

function gethp()
	for i=1,heal do
		if (hp<maxhp) then
			hp+=1
			sfx(57)
			wait(8)
		end
	end
end

function loshp()
	for i=1,bleed do
		if (hp>0) then
			hp-=1
			shake=1.001
			sfx(56)
			wait(9)
		end
	end
	if hp==0 then
		sfx(54)
		wait(10)
		resetdev()
		tmr=30
		_upd=upd_gameover
		_drw=drw_gameover
	end
end

function monsterlmt()
	local x,y,r
	x=cardpos[oldcursel].x
	y=cardpos[oldcursel].y
	r=5
	r2=10
	for i=1,30 do
		r-=0.14
		r2-=1.2
		x=lerp(x,70,easeinovershoot(i/20))
		y=lerp(y,88,easeinovershoot(i/20))
		circfill(x,y+sin(time()*2)*2,r+1,9)
		circfill(x-6,(y-6)+sin(time()*2)*2,r+0,9)
		circfill(x-8,(y-8)+sin(time()*2)*2,r,9)
		
		--
		circ(
			70,90,r2,9
		)
		
		yield()
	end
end

function statsboard()
	local yheight=0
	local s="game over"
	for i=1,10 do
		yheight+=1.3
		
		rectfill(
			10,70-yheight,
			110,70+yheight,
			1
		)
		
		? s,64-(#s*2),64,0
		? s,64-(#s*2),63+sin(time()/1.2)*.2,9
		? "rooms cleared: "..room,32,72,13
		yield()
	end
end

function hidehand()
	for i=1,40 do
		drw_deck(10,88)
		drw_weapon(70,90,83,88)
		drw_flee()
		yield()
	end
		
	async(carddeal)
	wait(40)
	dealcards(totcards)
end
-->8
--★
function drw_chkdeck(tbl,x,y,col)
	if #tbl>0 then
		for c=1,#tbl do
			? "\#0"..tbl[c].suit.."."..tbl[c].rank,x,y+((c-1)*6),col
		end
	else
		? "\#0[-x-]",x,y,col
	end
end

function lerp(a,b,t)
	return a+(b-a)*t
end

function easeinovershoot(t)
	return 1.7*t*t*t-.7*t*t
end

function easeoutovershoot(t)
	t-=1
	return 1+1.7*t*t*t+.7*t*t
end

function easeoutbounce(t)
    local n1=7.5625
    local d1=2.75
   
    if (t<1/d1) then
        return n1*t*t;
    elseif(t<2/d1) then
        t-=1.5/d1
        return n1*t*t+.75;
    elseif(t<2.5/d1) then
        t-=2.25/d1
        return n1*t*t+.9375;
    else
        t-=2.625/d1
        return n1*t*t+.984375;
    end
end

function invlerp(a,b,v)
	return (v-a)/(b-a)
end
-->8
--sprites
menu="⁶-b⁶x8⁶y8²1ᶜ2⁶.も89」■CCc⁶.チテおおゆゆゆ~⁶.かエん♥♥⧗39⁶.エo'♥んんリャ⁶.ン◜◝◝◝○??⁶.○○○ᶠ0<かト⁶.◝◝◝◝ユろᵇ゜⁶.リs9「らルヲル⁶.ョ<ら◝◝◝◝◝²1⁶.\0◜○○}。\r⁵⁸⁶-#ᶜ3⁶.\0\0\0██²²\0⁸⁶-#ᶜ4⁶.\0\0\0\0\0`px⁸⁶-#ᶜb⁶.\0\0█\0²\0\0\0²1ᶜ2⁶.ヲ◝◝◝トチらら⁸⁶-#ᶜ3⁶.\0\0\0\0\0  \0⁸⁶-#ᶜ4⁶.\0\0\0\0\0³゜゜⁸⁶-#ᶜb⁶.\0\0\0\0 \0\0\0²2 ²2ᶜ9⁶.\0\0pヲもヲpユ⁸⁶-#ᶜf⁶.\0\0█\0@\0█\0²2ᶜ9⁶.\0\0\0¹³²、¥⁸⁶-#ᶜf⁶.\0\0゜~ュョネハ²2⁶.\0\0\0\0\0¹³³ \n²2ᶜ1⁶.おえよロ◝◝ワメ⁸⁶-#ᶜ3⁶.\0\0\0¹\0\0⁸□²2ᶜ1⁶.⬇️♥かフんoョヨ⁶.を♥³³?ョ▒¹⁶.⁵⁷⁷³²⁶⁷●⁶. 0、アG#3•²2⁶.0「⁘⁙「「「「⁸⁶-#ᶜ4⁶.\0\0\0⁸&dナノ²2ᶜ1⁶.█ら@pぬユヲ|⁸⁶-#ᶜ4⁶.\0\0\0\0\0\0\0³²2ᶜ1⁶.\0\0ニ<ᶠ◝▒\0²2⁶.\0\0\0\0\0¹¹\0⁸⁶-#ᶜ4⁶.\0\0\0\0\0█らナ²2ᶜ1⁶.ををアヲヲナらら⁸⁶-#ᶜ4⁶.893⁷⁶゜?゜⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0\0 ²1ᶜ4⁶.ウウヒユユュ◜ュ⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0\0²²2ᶜ4⁶.\0\0りネ◝◝◝◝²2⁶.\0\0「ヨャ◝◝◝⁸⁶-#ᶜ9⁶.ナナナ\0\0\0\0\0²4⁶.'g○♥\0\0\0\0⁸⁶-#ᶜf⁶.ス▤█\0\0\0\0\0²4ᶜ2⁶.ヲヲユユユヲ\0\0⁸⁶-#ᶜ9⁶.\0\0	ᶠᵉ\0\0\0⁸⁶-#ᶜf⁶.⁷⁷⁶\0\0\0\0\0²4ᶜ2⁶.◝◝◝○??><\n²1ᶜ3⁶.2\0■⁙CBFウᶜ2⁶.ᵉᶜᶜ⁸███@⁶.◜◝◜ュ\0▒ヲユ⁶.ss3■█◝◝◝²1⁶.ユヲヘA¹¹\0\0⁸⁶-#ᶜ4⁶.\0\0▮ぬヲヲュ|²1ᶜ2⁶.⁷⁷▮\0@ \0\0⁸⁶-#ᶜ4⁶.ナ ⁷⬇️⬇️りユヲ²1ᶜ2⁶.ヲユナら█\0\0\0⁸⁶-#ᶜ4⁶.¹⁸゛?○◝ョ}²1ᶜ2⁶.○○◝◝○?8「⁸⁶-#ᶜ4⁶.██\0\0█ら\0\0⁸⁶-#ᶜ5⁶.\0\0\0\0\0\0██⁸⁶-#ᶜd⁶.\0\0\0\0\0\0\0²²2ᶜ4⁶.ユリ◝◝◝◝◝◜⁸⁶-#ᶜ5⁶.\0\0\0\0\0\0\0¹²1ᶜ4⁶.゜⁷ᶠ⁷⁷⁵⁵⁵⁸⁶-#ᶜ5⁶.\0\0@\0██\0\0⁸⁶-#ᶜ9⁶. \0▮「「⁸⁸⁸⁸⁶-#ᶜd⁶.\0\0\0@@@ら@⁸⁶-#ᶜf⁶.\0\0\0\0\0\0\0█²1ᶜ4⁶.ュユュュヲスオオ⁸⁶-#ᶜ5⁶.\0\0¹\0\0\0\0\0⁸⁶-#ᶜ9⁶.²\0\0\0⁴\0⁸⁸⁸⁶-#ᶜd⁶.\0\0\0¹¹¹¹¹²4ᶜ5⁶.\0\0\0\0\0\0█ら²4ᶜ1⁶.\0\0\0\0\0\0qク⁸⁶-#ᶜd⁶.\0\0\0\0\0\0\0 ²4  ᶜ2⁶.80 \0\0\0\0\0\n²1ᶜ3⁶.ウ🅾️ᶜ²&fらら⁸⁶-#ᶜ5⁶.\0\0¹¹¹\0⁶‖²1ᶜ2⁶.@\0\0\0\0\0\0\0⁸⁶-#ᶜ4⁶.⁴\0⁸⁸\0⁸、ᶜ⁸⁶-#ᶜ5⁶.\0\0\0\0█ららら²1ᶜ2⁶.ヲ◜゛\0\0\0\0\0⁸⁶-#ᶜ3⁶.\0\0\0フッュ|⁘⁸⁶-#ᶜ5⁶.\0\0\0\0¹\0█\n²1ᶜ2⁶.○⁴\0\0\0\0\0\0⁸⁶-#ᶜ3⁶.\0\0웃♪⁴²\0\0²1⁶.\0ᶠᶠ³¹\0\0\0⁸⁶-#ᶜ4⁶.>0\0\0\0ナ█☉⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0`p²1ᶜ4⁶.~゜🅾️\0\0レ#⁙⁸⁶-#ᶜ9⁶.\0\0\0\0\0²オナ²1ᶜ4⁶.NG⁷⁴\0⁷⁷³⁸⁶-#ᶜ5⁶.\0\0\0\0⁸▮▮ ⁸⁶-#ᶜ9⁶.\0\0@\0\0\0\0⁴⁸⁶-#ᶜd⁶.\0▮「⁸▮`@\0²1ᶜ4⁶.「\0\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.\0\0²¹¹\0\0\0⁸⁶-#ᶜd⁶.³¹\0\0\0\0\0\0²1ᶜ4⁶.◜>゛ᵉ²\0\0\0⁸⁶-#ᶜ5⁶.¹¹¹\0\0\0\0¹⁸⁶-#ᶜ9⁶.\0らナぬもゆ>v²1ᶜ4⁶.¹¹\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.\0\0\0 0\0▮\0⁸⁶-#ᶜ9⁶.⁴░⁵¹³⁷⁷²⁸⁶-#ᶜa⁶.\0\0\0█\0\0\0\0⁸⁶-#ᶜd⁶.ら@ら@らpら@⁸⁶-#ᶜf⁶.\0\0\0\0\0█\0\0²1ᶜ4⁶.ららららナナ@\0⁸⁶-#ᶜ5⁶.\0\0\0\0⁴\0⁴\0⁸⁶-#ᶜ9⁶.▮▮▮\0\0▮0 ⁸⁶-#ᶜd⁶.¹¹¹³³⁷¹¹²1ᶜ4⁶.?゜゛¥ᵉ⁶⁶⁷⁸⁶-#ᶜ5⁶.@@@\0\0\0\0@⁸⁶-#ᶜ9⁶.\0  $0800²1ᶜ5⁶.\0\0 @@\0\0\0⁸⁶-#ᶜ9⁶.ᶜ\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.`@\0\0\0\0\0\0²1ᶜ4⁶.ンヨユユナナ\0\0⁸⁶-#ᶜ5⁶.\0\0\0\0⁸⁴⁴²⁸⁶-#ᶜ9⁶.\0\0¹\0▮▮ユユ⁸⁶-#ᶜd⁶.\0⁴ᶜ⁸⁴³¹\0²4ᶜ9⁶.\0\0\0\0\0█らナ²4ᶜ3⁶.\0\0\0\0█らユヲ⁸⁶-#ᶜ9⁶.\0\0cめU?ᶠ⁷\n²1ᶜ3⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.⁙#C³³」98²1ᶜ4⁶.⁸⁸\0\0   \0⁸⁶-#ᶜ5⁶.ナナナユPPPユ²1⁶.⁶²\0\0@ナユヲ⁶.「、\0⁸せけのス²1ᶜ3⁶.\0⁶⁷\0▮p █⁸⁶-#ᶜ5⁶.\0\0\0\0¹\0▮⁸⁸⁶-#ᶜ9⁶.ュ「\0\0\0\0\0\0²1ᶜ3⁶.\0\0\0\0⁷、、y⁸⁶-#ᶜ4⁶.³▮█\0\0\0\0\0⁸⁶-#ᶜ5⁶.\0\0\0\0\0\0\0⁶⁸⁶-#ᶜ9⁶.ユナ\0゜8` \0²1ᶜ4⁶.³¹¹\0\0\0\0\0⁸⁶-#ᶜ9⁶.⁴⁶ᵉ゜??>>²1ᶜ5⁶.███@\0\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0█████⁸⁶-#ᶜd⁶.\0\0\0\0⁵⁴\0\0²1ᶜ5⁶.\0\0\0\0\0█@ ⁸⁶-#ᶜ9⁶.ワワフO\r。\r³²1ᶜ5⁶.(0▮「⁶²¹³⁸⁶-#ᶜ9⁶.\0\0   \0\0\0⁸⁶-#ᶜa⁶.\0\0\0\0\0\0 \0⁸⁶-#ᶜd⁶.@DB\0\0@PP²1ᶜ4⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.\n⁶⁵ᶜ0きDd⁸⁶-#ᶜ9⁶.\0██\0\0\0²\0⁸⁶-#ᶜd⁶.¹■ \0\0¹¹¹⁸⁶-#ᶜf⁶.\0\0²²²\0\0\0²1ᶜ4⁶.³\0\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.███\0\0\0¹²⁸⁶-#ᶜ9⁶.twsセスチスナ²1ᶜ5⁶.\0\0\0¹\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0P▮▮\0²1ᶜ4⁶.\0\0\0\0\0\0\0ら⁸⁶-#ᶜ9⁶.ユユヲュ◜◜◜>²3ᶜ4⁶.|ュュ>◀き\n⁙⁸⁶-#ᶜ9⁶.⬇️³³りホ_ul²3ᶜ5⁶.\0らナユ☉▤ュュ⁸⁶-#ᶜ9⁶.³³¹¹\0\0\0\0\n²1ᶜ5⁶. ▮`881#ᵉ²1ᶜ4⁶. p000▮▮▮⁸⁶-#ᶜ5⁶.ス☉っっっヘヘナ²1ᶜ4⁶.\0\0\0\0\0\0\0ら⁸⁶-#ᶜ5⁶.ヲュュュュュ<ᵉ²1ᶜ4⁶.▮ら`⁸<⁶³\0⁸⁶-#ᶜ5⁶.\r。。5らっユン²1ᶜ3⁶.らスまCり█\0\0⁸⁶-#ᶜ4⁶.\0¹\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.$ F😐&sン}²1ᶜ3⁶.yャャリ♥⁶⁶`⁸⁶-#ᶜ5⁶.⁶⁴\0\0pヨホ◆²1ᶜ3⁶.\0⁴。=}zH@⁸⁶-#ᶜ5⁶.███🐱🐱⁵&.⁸⁶-#ᶜ9⁶.|x`@\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0███²1ᶜ5⁶.\0¹²⁵\0\0¹²⁸⁶-#ᶜ9⁶.█████\0\0\0⁸⁶-#ᶜd⁶.¹²¹²¹\0\0\0²1ᶜ5⁶.\0█@`▮\0\0\0⁸⁶-#ᶜ9⁶.³⁷⁷³¹\0\0\0⁸⁶-#ᶜd⁶.█@ ▮\0@ 0²1ᶜ5⁶.⁙▮0⁘、‖‖5⁸⁶-#ᶜ9⁶.\0\0⁸ ²²²²⁸⁶-#ᶜd⁶.@LBB@@@█⁸⁶-#ᶜf⁶. \0\0\0\0⁸\0\0²1ᶜ5⁶.ノ😐⁶⁘、TTV⁸⁶-#ᶜ9⁶.²\0⁸\0 (  ⁸⁶-#ᶜa⁶.\0\0\0²\0\0\0\0⁸⁶-#ᶜd⁶.¹¹¹¹¹¹¹\0²1ᶜ5⁶.\0¹¹³⁴\0\0\0⁸⁶-#ᶜ9⁶.ナユユナ@\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0¹²⁶²1ᶜ5⁶.█らきオ█\0@ ⁸⁶-#ᶜd⁶.@ @ @███²3ᶜ4⁶.ら█ ら\0\0\0\0⁸⁶-#ᶜ9⁶.?○ト?◝○゜ᶠ²3ᶜ1⁶.\0\0@█████⁸⁶-#ᶜ4⁶.\r⁴\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.\0\0\0\0\0\0\0⁸⁸⁶-#ᶜ9⁶.r{?ᶠ¹\0\0\0²3ᶜ1⁶.\0\0\0\0⁸▮▮▮⁸⁶-#ᶜ5⁶.██ららユム	を\n²1⁶.><yリネフんれ²1ᶜ4⁶.\0\0\0▮\0\0\0█⁸⁶-#ᶜ5⁶.ユpphx」み}²1ᶜ4⁶.`0「⁸ᶠ⁷³¹⁸⁶-#ᶜ5⁶.★\n⁴⁶ナユ\0²²1⁶.p\0◜゜かフヲユ⁶.x`◝ヲニ♥ᵉn²1ᶜ3⁶.ら░\0き \0\0\0⁸⁶-#ᶜ5⁶.゜Zゆ゜゛¹¹\0²1ᶜ3⁶.\0²\n¥:h` ⁸⁶-#ᶜ5⁶.fdp`@\0█\0⁸⁶-#ᶜd⁶.██████\0\0²1ᶜ5⁶.²²²²⁶⁷³⁷⁸⁶-#ᶜd⁶.¹\0¹\0¹\0\0\0²1⁶.(  ▮⁸\0\0\0²1ᶜ5⁶.⁘「⁸\0`0「ᶜ⁸⁶-#ᶜd⁶.ら@ ▮⁸ᶜ⁶@²1ᶜ5⁶.⁘ᶜ⁸\0³⁶ᶜ「⁸⁶-#ᶜd⁶.¹¹²⁴⁸「0¹²1⁶.\n²²⁴⁸\0\0\0²1ᶜ5⁶.    0pナp⁸⁶-#ᶜd⁶.ら█ら█ら█\0\0²1ᶜ3⁶.ユユヘlモヤエᵉ⁸⁶-#ᶜ5⁶.\0\0\0█\0\0 ナ⁸⁶-#ᶜ9⁶.ᶠᶠ⁷³¹\0\0\0²1ᶜ3⁶.'\0…まめ::¥⁸⁶-#ᶜ5⁶.「?/³\0\0@ ²1ᶜ3⁶.ᶠᶠᶠ⁷³³³\0⁸⁶-#ᶜ5⁶.ナナナ` \0\0³\n²1ᶜ4⁶.\0\0█\0\0 `ぬ⁸⁶-#ᶜ5⁶.▒\0\0\0\0\0█\0²1ᶜ4⁶.ららDD⁶³¹¹⁸⁶-#ᶜ5⁶.=?む:9😐をヒ²1ᶜ4⁶.\0\0\0\0\0ナぬ\0⁸⁶-#ᶜ5⁶.¹\0\0\0=゜ᶠ⁷²1ᶜ4⁶.\0\0\0\0\0³⁷゛⁸⁶-#ᶜ5⁶.ナら█\0\0\0\0\0²1⁶.vdd⁴D⁴▮\0  ⁶.²\0\0\0\0\0\0\0ᶜd⁶.█\0@ ▮▮\0\0²1ᶜ5⁶.⁴\0\0\0\0\0\0\0⁸⁶-#ᶜ9⁶.\0@\0\0\0□\0\0⁸⁶-#ᶜd⁶.¹¹\0@@\0\0\0²1ᶜ5⁶.▮\0\0\0\0\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0¹¹\0\0\0⁸⁶-#ᶜd⁶.らA\0\0\0$\0\0²1ᶜ5⁶.\0\0\0\0\0\0\0▮⁸⁶-#ᶜd⁶.\0\0¹²⁴⁴\0\0²1ᶜ5⁶. \0\0\0\0\0\0\0²1ᶜ3⁶.ᶜᶜᵉ\n\0\0\0\0⁸⁶-#ᶜ5⁶.るるらら@@\0\0²1ᶜ3⁶.\n²²\0\0\0\0\0⁸⁶-#ᶜ5⁶.08▮□⁘▮\0\0²1⁶.³³³³\0\0\0\0\n²1ᶜ4⁶.PP\0⁴\0\0⁘\0⁸⁶-#ᶜ5⁶.██らナユ\0\0H²1⁶.フ{=゜ᶠᶠ⁷⁷⁶.³\0\0\0\0\0\0\0ᶜ4⁶.ユナ`ら█\0\0\0⁶.ᶠ◝█\0¹¹\0\0⁶.\0¹♥_\0\0\0\0⁶.'9\0\0\0\0\0\0  ²1ᶜ8⁶.\0\0\0\0\0█ら@⁸⁶-#ᶜ9⁶.²\0\0\0\0\0\0█⁸⁶-#ᶜd⁶.▮\0\0□█@\0⁸²1ᶜ5⁶.\0\0\0\0\0\0\0█⁸⁶-#ᶜ8⁶.\0\0\0\0\0\0¹¹⁸⁶-#ᶜ9⁶. \0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.⁴\0\0$\0¹\0⁸²1ᶜ4⁶.008(.⁶▶ᵇ⁸⁶-#ᶜ5⁶.⁸ᶜ⁴⁶\0¹\0▮²1ᶜc⁶.\0\0\0``\0ナナ⁶.\0\0\0ff\0◝◝⁶.\0\0\0◀⁶\0?? \n²1ᶜ4⁶.\0\0\0\0⁸⁸▮ ⁸⁶-#ᶜ5⁶.X「⁘ろららら█²1⁶.²\0¹¹¹\0▒?²1ᶜ4⁶.\0\0█ナ\0\0\0\0⁸⁶-#ᶜ5⁶.\0\0L□.⁷¹\0²1ᶜ4⁶.`<ᶠ¹\0\0\0\0²1ᶜ3⁶.\0\0\0ららナユユ⁸⁶-#ᶜ4⁶.⁷\0\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.\0\0\0\0 ▮⁸ᶜ⁸⁶-#ᶜb⁶.\0\0█\0\0\0\0\0²1ᶜ3⁶.\0\0\0?○?\0⁷⁸⁶-#ᶜb⁶.\0~◝ら█ら◝ヲ²1ᶜ3⁶.\0\0\0\0\0000ュ◜⁸⁶-#ᶜb⁶.\0\0ᶠ?◝エ³¹²1ᶜ3⁶.\0\0\0\0\0\0\0¹⁸⁶-#ᶜb⁶.\0\0\0\0\0³⁷ᵉ²1 ²1ᶜ4⁶.\0\0\0@\0@\0█⁸⁶-#ᶜ9⁶.ら\0\0█\0\0\0@⁸⁶-#ᶜa⁶.\0ら\0\0\0█\0\0⁸⁶-#ᶜd⁶.□□\0\0\0\0\0\0²1ᶜ4⁶.ららら█\0\0\0\0⁸⁶-#ᶜ9⁶.¹\0\0\0\0¹\0\0⁸⁶-#ᶜa⁶.\0¹\0¹\0\0\0\0⁸⁶-#ᶜd⁶.$$\0\0\0\0\0\0²1ᶜ4⁶.\r⁷⁙ᶜ¹▮「\0⁸⁶-#ᶜ5⁶.@` 0ᵉ#`8²1ᶜc⁶.\0ナナ\0ナ   ⁶.\0◝◝\0◝\0\0g⁶.\0??\0?  & \n²1ᶜ4⁶.\0\0\0 \0\0@ ⁸⁶-#ᶜ5⁶.らら██\0\0\0\0²1⁶.゜ᶠᶠᶠᶠ゜?: ⁶.\0\0\0█ららナユ²1ᶜ3⁶.ヲ<ュュ~◜ヲナ⁸⁶-#ᶜ5⁶.⁶²³³¹¹⁷゜⁸⁶-#ᶜb⁶.\0ら\0\0█\0\0\0²3ᶜ5⁶.\0\0\0\0\0\0「゜⁸⁶-#ᶜb⁶.ュ○゜?g\0\0\0²3⁶.⁷ᵉ、「\0\0\0\0²3ᶜ1⁶.ユナら█\0\0\0\0⁸⁶-#ᶜb⁶.ᶜ「0pナナナら²1⁶.\0\0\0\0\0¹¹¹ᶜ2⁶.\0\0\0\0\0A█ワ²1⁶.\0\0\0\0\0、<s⁸⁶-#ᶜ5⁶.\0\0\0█\0\0\0\0²1ᶜ2⁶.\0\0\0\0\0\0█\0⁸⁶-#ᶜ4⁶.ᶜ⁶⁷⁷\0²²²⁸⁶-#ᶜ5⁶.3	`8゜¹\0 ²1ᶜc⁶.        ⁶.■▶⁘w\0005UU⁶.%%%' #%% \n²1ᶜ4⁶.0<゛ᵉ◆ん¹ ⁸⁶-#ᶜ5⁶.\0\0\0\0\0\0らら²1ᶜ4⁶.\0\0\0\0¹\0\0\0⁸⁶-#ᶜ5⁶.ュュゆ?~○ws²1⁶.\0¹³³³³³▒²1ᶜ3⁶.\0らナユx8、⁶⁸⁶-#ᶜ5⁶.ヲ8、ᶜ●をネン²3⁶.◜ュ◜◝◝◝◝◝²3ᶜ1⁶.\0\0\0\0\0²⁴ᶜ⁸⁶-#ᶜ5⁶.⁷ᶠか??ョャリ²3ᶜ1⁶.\0\0\0\0\0\0⁶⁴⁸⁶-#ᶜ5⁶.\0\0\0>◝○ンャ²3⁶.\0\0\0\0\0¹¹¹⁸⁶-#ᶜb⁶.らららららららら²1ᶜ2⁶.\0@\0█ナらら█⁸⁶-#ᶜb⁶.¹¹¹¹\0\0\0\0⁸⁶-#ᶜe⁶.\0\0\0\0\0¹¹¹⁸⁶-#ᶜf⁶.\0\0\0\0\0\0²²²1ᶜ2⁶.ナ▤xフか○'●⁶.}ヌ゛「ッ◜◜ン²1⁶.\0███り¹らる⁸⁶-#ᶜ4⁶.⁴⁴⁴⁴⁴⁴⁴⁴⁸⁶-#ᶜ5⁶.        ²1ᶜ2⁶.¹\0\0³⁵\0¹Q⁸⁶-#ᶜc⁶.        ²1⁶.UV\0w‖3‖u⁶.%' !!!!'²1ᶜd⁶.\0\0\0\0\0\0\"$⁸⁶-#ᶜf⁶.\0\0\0\0\0³⁘\0\n²1ᶜ4⁶.<ᶠ⁷³\0\0\0\0⁸⁶-#ᶜ5⁶.らユ8もよよよト²1⁶.ンュッャンンンq⁶.りニニニユユヲヲ⁶.◝◝よ○○◝◝◝⁶.◝◝◝◝◜◜◜ッ⁶.ワヤヤハハハa¹⁶.ャャャャャンヲヲ²1ᶜ3⁶.<▮8「\0\0\0\0⁸⁶-#ᶜ5⁶.³ᶠ⁷'?○○○⁸⁶-#ᶜb⁶.@`\0\0\0\0\0\0⁸⁶-#ᶜe⁶.████\0\0\0\0²1ᶜ2⁶.\0\0``「⁸r█⁸⁶-#ᶜe⁶.¹³³\0\0\0\0\0⁸⁶-#ᶜf⁶.⁶⁴\0\0\0\0\0\0²1ᶜ2⁶.█(ロ◆vンヲ◝⁶.■ら>ュヲャ⁷れ²1⁶.れられられれ█⬇️⁸⁶-#ᶜ4⁶.⁴\0\0\0\0\0\0\0⁸⁶-#ᶜ5⁶. $$$$$dD²1ᶜ2⁶.S⧗³ナか?ᶠ?⁸⁶-#ᶜc⁶.  ナ\0\0\0\0\0²1ᶜ2⁶.\0\0\0²\0⁸⁴「⁸⁶-#ᶜc⁶.\0\0◝\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0\0█⁸⁶-#ᶜf⁶.\0\0\0\0\0\0█@²1ᶜ5⁶.\0\0\0\0\0\0\0🐱⁸⁶-#ᶜc⁶.  ?\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0♥¹²1ᶜ5⁶.$6□□\0\0\0¹⁸⁶-#ᶜd⁶.\0\0\0\0\0³³.⁸⁶-#ᶜf⁶.\0\0\0\0\0\0ᶜ▮\n²1ᶜ5⁶.んれらナユp8.⁶.q \0\0\0\0\0\0⁶.ヲュュヲ\0\0\0\0⁶.○゜⁷\0\0\0\0\0⁶.ワみB$\0\0\0\0⁶.²\0\0\0█ららナ⁶.ュュ◜◝◝シ/゜²1⁶.○w{{}}>>⁸⁶-#ᶜ8⁶.███████\0²1ᶜ2⁶.ムナヲヲヲムオユ⁸⁶-#ᶜ8⁶.¹³⁷⁷⁷³²\0²1ᶜ2⁶.◝◝◝xいネ◝⬅️²1⁶.よ{wo゜??>⁸⁶-#ᶜ5⁶.\0\0\0\0\0\0█ら⁸⁶-#ᶜe⁶.\0\0██らら@\0²1ᶜ2⁶.██\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.@@\0\0\0\0³¹⁸⁶-#ᶜe⁶.\0⁴⁴ᶜ\0¹██⁸⁶-#ᶜf⁶.⁷³れリエを\0\0²1ᶜ2⁶.゜゛ っスナナユ⁸⁶-#ᶜd⁶.\0\0\0\0\0\0⁴⁶⁸⁶-#ᶜe⁶.\0\0²⁶⁶⁷³¹⁸⁶-#ᶜf⁶.\0¹¹¹¹\0\0\0²1ᶜ2⁶.80  !/⁷7⁸⁶-#ᶜ5⁶.\0█らら@\0\0\0⁸⁶-#ᶜd⁶.ら@\0\0\0\0\0\0²1ᶜ5⁶.¹\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0☉\0らユ█⁸⁶-#ᶜf⁶.\0\0\0pヲ>ᵉ\n²1ᶜ5⁶.⁷ᶜ⁸▮\0\0\0⁶⁸⁶-#ᶜd⁶.x@@ ¹²³¹⁸⁶-#ᶜf⁶.\0\0\0\0\0¹\0\0\n²1ᶜ5⁶.&:⁙▶⁷³³¹²1ᶜ3⁶.\0\0\0█らユヲ~⁸⁶-#ᶜ5⁶.\0\0\0\0\0\0\0█²1ᶜ3⁶.`<?゜゜⁷¹\0⁸⁶-#ᶜ5⁶.\0\0\0\0\0⁸ᵉ⁷²1  ⁶.ユユ\0\0\0\0\0\0⁶.³\0█ら ██\0⁶.よトフヨヲ◝◝◝²2ᶜ3⁶.\0<◝◝◜ュナ\0⁸⁶-#ᶜ5⁶.ᶠ³\0\0¹³゜◝²2ᶜ1⁶.ら\0█\0`ら\0\0⁸⁶-#ᶜ3⁶.\0\0\0¹³⁷゜○⁸⁶-#ᶜ5⁶.\0\0¹🐱う8ナ█²2ᶜ1⁶.ᵉ⁷██らナヨリ⁸⁶-#ᶜ5⁶.ナヲ~○?゜ᵉᶜ²1⁶.\0\0\0\0\0██ら⁸⁶-#ᶜd⁶.\0████\0\0\0⁸⁶-#ᶜe⁶.█\0\0\0\0\0\0\0²1ᶜ2⁶.ュュ◜◜ト8ョ◝⁸⁶-#ᶜd⁶.³³¹¹\0\0\0\0²1ᶜ2⁶.7にに⬇️\0らネネ⁸⁶-#ᶜ5⁶.\0\0\0\0▮⁸⁸ᶜ⁸⁶-#ᶜ6⁶.\0\0\0⁸⁷³\0\0⁸⁶-#ᶜd⁶.\0\0\0p⁸⁴⁴\0²1ᶜ2⁶.\0\0\0\0\0\0▮0⁸⁶-#ᶜ5⁶.ら█p▮😐ᶜ\0\0⁸⁶-#ᶜd⁶.\nᶜᵉ²²²\0\0²1ᶜ5⁶.⁷²\0\0¹¹³¹⁸⁶-#ᶜd⁶.\0\0\0\0\0\0\0ᵉ\n²1ᶜ3⁶.██\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.\0@ナユユヲュ◜²1ᶜ3⁶.?³\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.らュ?ᶠ⁷³\0\0²1⁶.³¹\0\0\0\0\0\0    ⁶.おxナら\0\0\0\0⁶.◝◜◝ンネウ▤0²3⁶.¹³³⁷??◝◝²1ᶜ2⁶.\0\0\0\0\0█らナ⁸⁶-#ᶜ5⁶.⁵¹¹¹¹¹\0\0²1ᶜ2⁶.⁸ᶜᵉᵉᶠᶠᶠᶠ⁸⁶-#ᶜ4⁶.\0████ららら⁸⁶-#ᶜ5⁶.ら@@`` \0\0²1ᶜ2⁶.◝◝◝0ょ◝◝◝⁶.ネ゜◝◝◝◝◝◝⁶.i}pO゜か◆?²1⁶.\0\0\0\0ᵉᶠ゜ᶠ⁸⁶-#ᶜ5⁶.¹\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.²²\0\0\0\0\0\0"
dead="⁶-b⁶x8⁶y8ᶜ1⁶.◝◝◝モ◝め◝ち⁶.◝◝◝モ◝め◝ち⁶.◝◝◝モ◝め◝ち⁶.◝◝◝モ◝め◝ち⁶.◝◝◝モ◝め◝ち⁶-#⁶.◝◝◝モ◝め◝🐱⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0\0|⁶-#ᶜ1⁶.◝◝◝モ◝め◝⌂⁸⁶-#ᶜa⁶.\0\0\0\0\0\0\0 ⁶-#ᶜ1⁶.◝◝◝モ◝め◝ち⁶-#⁶.◝◝◝モ?いエち⁸⁶-#ᶜa⁶.\0\0\0\0ら`0▮⁶-#ᶜ1⁶.◝◝◝モ◜ね◆*⁸⁶-#ᶜa⁶.\0\0\0\0¹ᵉpら⁶-#ᶜ1⁶.◝◝◝モ◝め◝ち⁶.◝◝◝モ◝め◝ち⁶.◝◝◝モ◝め◝ち⁶.◝◝◝モ◝め◝ち⁶.◝◝◝モ◝め◝ち⁶.◝◝◝モ◝め◝ち\n⁶.◝ちUちUちU\0⁶.◝ちUちUちU\0⁶.◝ちUちUちU\0⁶.◝ちUちUちU\0⁶-#⁶.◝*U*‖ち‖\0⁸⁶-#ᶜ9⁶.\0██ら@@@@⁶-#ᶜ1⁶.\0*UちUちU\0⁸⁶-#ᶜ9⁶.◝り█\0\0\0⁸\0⁶-#ᶜ1⁶.◜そPきQけE\0⁸⁶-#ᶜ9⁶.\0\0¹³²⁴\0\0⁸⁶-#ᶜa⁶.¹³⁶ᶜᶜ「「「⁶-#ᶜ1⁶.◝ちUちUちU\0⁶-#⁶.ヤちE\nUちU\0⁸⁶-#ᶜa⁶.▮▮▮ユ\0\0\0\0⁶-#ᶜ1⁶.~そUちUちE\0⁸⁶-#ᶜa⁶.▒²²¹\0\0▮▮⁶-#ᶜ1⁶.◜ちTそPそQ\0⁸⁶-#ᶜ2⁶.\0\0\0\0\0\0\0 ⁸⁶-#ᶜ9⁶.\0\0²⁴⁴⁴ᶜᶜ⁸⁶-#ᶜa⁶.¹¹¹²³²²²⁶-#ᶜ1⁶.◝ちUちUちU\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0 \0⁶-#ᶜ1⁶.◝ちUちUちU\0⁶.◝ちUちUちU\0⁶.◝ちUちUちU\0⁶.◝ちUちUちU\0\n⁶.U\0D\0■\0\0\0⁶.U\0D\0■\0\0\0⁶.U\0D\0■\0\0\0⁶-#⁶.U\0D\0■\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0ナ0▮⁶-#ᶜ1⁶.‖\0D\0■\0\0\0⁸⁶-#ᶜ9⁶.@ら█\0\0¹る~⁶-#ᶜ1⁶.U\0@\0▮\0\0\0⁸⁶-#ᶜ6⁶.\0\0\0\0\0\0\0ら⁸⁶-#ᶜ9⁶.\0³⁷⁷³³\0\0⁸⁶-#ᶜa⁶.\0\0\0\0\0\0ら ⁶-#ᶜ1⁶.E\0⁴\0¹\0\0\0⁸⁶-#ᶜ6⁶.\0\0\0█ナナ#リ⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0▮⁸⁸⁶-#ᶜa⁶.「「スx「゜ᶜ⁴⁸⁶-#ᶜd⁶.\0\0\0\0\0\0ら\0⁶-#ᶜ1⁶.U\0\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.\0\0◜れョユ◝¹⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0\0◜⁸⁶-#ᶜa⁶.\0◜¹\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0<²ᶠ\0\0⁶-#ᶜ1⁶.U\0\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.\0\0?ン◝◝◝ユ⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0\0ᶠ⁸⁶-#ᶜ9⁶.\0xら\0\0\0\0\0⁸⁶-#ᶜa⁶.\0⁷\0\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0⁶\0\0\0\0⁶-#ᶜ1⁶.U\0D\0\0\0\0\0⁸⁶-#ᶜ6⁶.\0\0\0¹⁷ᶠ゜ᶠ⁸⁶-#ᶜ9⁶.\0\0³ᵉ「ぬ█ら⁸⁶-#ᶜa⁶.\0\0\0\0█@`0⁶-#ᶜ1⁶.Q\0@\0▮\0\0\0⁸⁶-#ᶜ9⁶.⁴⁴⁶²#¹¹\0⁸⁶-#ᶜa⁶.²²¹¹\0\0\0\0⁶-#ᶜ1⁶.U\0D\0■\0\0\0⁶.U\0D\0■\0\0\0⁶.U\0D\0■\0\0\0⁶.U\0D\0■\0\0\0⁶.U\0D\0■\0\0\0\n   ⁶-#ᶜ4⁶.\0\0\0@\0\0\0\0⁸⁶-#ᶜ9⁶.、\0\0\0\0\0\0\0⁶-#⁶.\0\0\0\0\0\0²@⁸⁶-#ᶜa⁶.\0\0\0\0██ら█⁶-#ᶜ4⁶.\0\0\0\0\0\0\0⁸⁸⁶-#ᶜ5⁶.\0\0\0\0²\0\0\0⁸⁶-#ᶜ6⁶.ナp<、\0\0@ ⁸⁶-#ᶜ9⁶.\0\0\0█らp、⁶⁸⁶-#ᶜa⁶.▮😐るc=ᶠ#¹⁸⁶-#ᶜc⁶.\0\0\0\0\0██オ²6ᶜ7⁶.\0\0██\0ナユュ⁸⁶-#ᶜ9⁶.ᶜ⁴³³\0\0\0\0⁸⁶-#ᶜa⁶.³³\0\0\0\0\0\0²7 ²7ᶜ6⁶.ら█\0\0\0\0\0\0⁸⁶-#ᶜ9⁶.\0\0ナ`\0\0\0\0⁸⁶-#ᶜa⁶.⁶>、うヲユ\0\0⁶-#ᶜ6⁶.⁷れナユヲユ`\0⁸⁶-#ᶜ7⁶.\0\0\0\0\0ᶜ゜○⁸⁶-#ᶜ9⁶.p0。ᵉ⁷\0\0\0⁸⁶-#ᶜa⁶.⁸ᶜ²¹\0³██⁶-#ᶜ2⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜ4⁶.\0\0\0\0\0\0▮▮⁸⁶-#ᶜ5⁶.\0¹\0²\0\0⁸⁸⁸⁶-#ᶜ6⁶.\0\0¹¹³¹⁴⁷⁸⁶-#ᶜ9⁶.¹²⁶ᶜᶜ\0\0\0⁸⁶-#ᶜa⁶.\0\0\0\0\0◜³\0⁶-#ᶜ4⁶.\0\0\0\0\0█ら█⁸⁶-#ᶜa⁶.\0\0\0\0\0¹⁷ᶜ⁶-#ᶜ4⁶.\0\0\0\0\0\0¹\0   \n    ⁶-#ᶜ2⁶.\0\0\0\0\0\0「、⁸⁶-#ᶜ4⁶.\0\0ら`8<⁶²⁸⁶-#ᶜ9⁶.ユユ8、⁴²\0\0⁸⁶-#ᶜd⁶.\0\0\0█ららナナ²4ᶜ6⁶.☉ュろサ6ササケ⁸⁶-#ᶜ9⁶.¹\0\0\0\0\0\0\0⁸⁶-#ᶜc⁶.p\0008(っ))+⁸⁶-#ᶜd⁶.\0\0³¹¹\0\0\0⁶-#ᶜ1⁶.\0\0@ナユ▮⁸ᶜ⁸⁶-#ᶜ5⁶.\0\0█\0\0\0\0\0⁸⁶-#ᶜ6⁶.¹\0\0\0¹³³¹⁸⁶-#ᶜ7⁶.◜ᶠ⁶⁶⁶\0\0\0⁸⁶-#ᶜc⁶.\0\0¹¹\0\0\0\0⁸⁶-#ᶜd⁶.\0ユ8「⁸ᶜ⁴²⁶-#ᶜ1⁶.\0\0\0¹¹³²ᶜ⁸⁶-#ᶜ5⁶.\0\0\0²²ᶜ、▮⁸⁶-#ᶜ6⁶.⁸゜、0ナら\0 ⁸⁶-#ᶜ7⁶.ワナナら\0\0\0\0⁸⁶-#ᶜd⁶.\0\0³ᶜ、0ナら⁶-#ᶜ1⁶.\0\0\0█らら@`⁸⁶-#ᶜ5⁶.\0\0\0\0 08「⁸⁶-#ᶜ6⁶.\0|>ᶠ⁷¹⁴⁴⁸⁶-#ᶜ7⁶.◝³¹\0\0\0\0\0⁸⁶-#ᶜd⁶.\0█らp「ᵉ³³⁶-#ᶜ1⁶.\0\0²⁷ᶠ、0ナ⁸⁶-#ᶜ5⁶.\0⁶\r8P`ら\0⁸⁶-#ᶜ6⁶.█▤0@き█\0\0⁸⁶-#ᶜ7⁶.? \0\0\0\0\0\0⁸⁶-#ᶜa⁶.@@ら█\0\0\0\0⁸⁶-#ᶜd⁶.\0¹\0\0\0\0\0\0⁶-#ᶜ4⁶.0 `@@@@ら⁸⁶-#ᶜ5⁶.⁸▮▮ \0\0¹¹⁸⁶-#ᶜ6⁶.⁵		、ᶠ゜゛゛⁸⁶-#ᶜa⁶.²⁶⁶³\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0000   ⁶-#ᶜ2⁶.\0\0\0\0\0@`\0⁸⁶-#ᶜ4⁶.\0\0\0\0⁴\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0▮「「⁸⁶-#ᶜa⁶.「「▮00 \0\0⁶-#ᶜ4⁶.\0\0²「0```⁸⁶-#ᶜ9⁶.\0\0<ナら███⁶-#⁶.\0\0\0\0¹¹¹\0  \n   ᶜ4⁶.\0\0█\0\0\0\0\0⁶-#ᶜ1⁶.     \0\0\0⁸⁶-#ᶜ2⁶.゛゛゛「\0\0\0▮⁸⁶-#ᶜ4⁶.\0¹¹¹▮\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0\0ᶜ⁸⁶-#ᶜa⁶.\0\0\0█らナナナ⁸⁶-#ᶜd⁶.ららら@\0\0\0\0²6ᶜ7⁶.\0\0\0\0\0\0ᶜᶜ⁸⁶-#ᶜa⁶.゛ᶠ⁷⁷³¹¹\0⁸⁶-#ᶜc⁶.\0 ((ᶜ\0\0\0⁸⁶-#ᶜd⁶.\0███らる█¹⁶-#ᶜ1⁶.⁴⁶²⁷⁷ᶜ「ユ⁸⁶-#ᶜ5⁶.\0\0\0\0\0³⁷ᵉ⁸⁶-#ᶜd⁶.³¹¹\0\0\0\0¹⁶-#ᶜ1⁶.ᶜᶜᶜᶜ⁴⁶²¹⁸⁶-#ᶜ5⁶.▮▮▮▮⁸⁸⁴🐱⁸⁶-#ᶜ6⁶.``ナナ \0▮「⁸⁶-#ᶜ7⁶.\0\0\0\0らナナ`⁸⁶-#ᶜd⁶.██\0\0▮▮⁸⁴⁶-#ᶜ1⁶.@@ら███\0\0⁸⁶-#ᶜ5⁶.88(HX@れ⬇️⁸⁶-#ᶜ6⁶.⁶⁶⁶⁶⁴\0\0⁴⁸⁶-#ᶜ7⁶.\0\0\0\0³ᶠ、「⁸⁶-#ᶜd⁶.¹¹■1 0 `⁶-#ᶜ1⁶.ナらららき!•か⁸⁶-#ᶜ5⁶.\0\0\0\0@らナ`²1ᶜ2⁶.\0██\0\0\0██⁸⁶-#ᶜ4⁶.█\0\0███\0\0⁸⁶-#ᶜ5⁶.¹³⁶⁶⁶⁶⁷⁷⁸⁶-#ᶜ6⁶.゛<「「「▮\0\0⁸⁶-#ᶜd⁶.`@`  (8「⁶-#ᶜ2⁶.\0\0\0\0「\0\0\0⁸⁶-#ᶜ4⁶.\0⁸\nᶠんy⁷\0⁸⁶-#ᶜ9⁶.「⁶⁵\0\0\0\0\0⁶-#ᶜ4⁶.p8ᶜ³¹\0\0\0⁸⁶-#ᶜ9⁶.█@▮⁴\0\0\0\0⁶-#   \n   ⁶-#ᶜ4⁶.\0⁴\0\0█ら`▮⁸⁶-#ᶜ9⁶.\0\0らら`0▮⁸⁶-#ᶜ2⁶.108ᶜᵉ¹¹¹⁸⁶-#ᶜ4⁶.\0⁸░🐱ねぬぬら⁸⁶-#ᶜ9⁶.NG³1\0\0\0\0⁸⁶-#ᶜa⁶.██@\0\0\0\0\0²1ᶜ4⁶.\0\0\0\0¹¹¹\0⁸⁶-#ᶜ5⁶.\0\0\0\0\0²\0\0⁸⁶-#ᶜ6⁶.ナら\0▮\0、ᵉ⁷⁸⁶-#ᶜ7⁶.「8ヲナナナユヲ⁸⁶-#ᶜd⁶.⁷⁶⁶ᶜ、\0\0\0²1ᶜ5⁶.、\0\0\0\0\0000「⁸⁶-#ᶜ6⁶.¹³³oゆおウヒ⁸⁶-#ᶜ7⁶.\0\0\0\0¹¹¹¹⁸⁶-#ᶜd⁶.²「██@`\0\0⁶-#ᶜ1⁶.¹\0█@@\0\0 ⁸⁶-#ᶜ5⁶.らら`008(▮⁸⁶-#ᶜ6⁶.⁸ᶜᵉᵉᶠ⁷▶ᶠ⁸⁶-#ᶜ7⁶.00▮\0\0\0\0\0⁸⁶-#ᶜd⁶.⁶³¹¹\0\0\0\0⁶-#ᶜ1⁶.¹³⁷⁶ᶜ⁴⁸⁸⁸⁶-#ᶜ5⁶.🅾️ᶜ「「▮「▮▮⁸⁶-#ᶜd⁶.pユナナナナナナ²1ᶜ5⁶.⧗れᵉᶜ⁸「\0\0⁸⁶-#ᶜ6⁶.\0\0\0\0  ``⁸⁶-#ᶜ7⁶.\0\0\0\0らら██⁸⁶-#ᶜd⁶.\0\0ヨリ▶⁷゜゜²1ᶜ2⁶.らら███\0\0\0⁸⁶-#ᶜ5⁶.³³\0\0\0█\0\0⁸⁶-#ᶜ6⁶.\0\0\0\0ᶜ0\0\0⁸⁶-#ᶜ7⁶.\0\0\0\0³ᶠ?゜⁸⁶-#ᶜd⁶.、、゜?p@らナ⁶-#ᶜ2⁶.\0\0¹¹³²²³⁸⁶-#ᶜ5⁶.\0\0\0\0\0¹¹\0⁶-#    \n   ⁶-#ᶜ4⁶.▮⁸⁸⁸⁸⁸\0\0⁸⁶-#ᶜ9⁶.ᶜ⁴⁶⁶⁶⁶゛>⁶-#ᶜ1⁶.\0\0@ら██\0\0⁸⁶-#ᶜ2⁶.\0\0\0\0@@█\0⁸⁶-#ᶜ4⁶.@@ \0\0\0\0\0⁸⁶-#ᶜ6⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0²⁴⁴⁸⁶-#ᶜd⁶.\0██\0\0\0\0\0²1ᶜ2⁶.\0\0\0\0\0\0\0¹⁸⁶-#ᶜ5⁶.\0\0\0\0\0\0000ナ⁸⁶-#ᶜ6⁶.³³●ᶜ8\0\0\0⁸⁶-#ᶜ7⁶.ュュx0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0¹れん◜ア「²1ᶜ5⁶.\0\0\0 0、⁶C⁸⁶-#ᶜ6⁶.@▒ら\0\0\0\0\0⁸⁶-#ᶜ7⁶.¹\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.ゆ~?か◆れり█⁶-#ᶜ1⁶.\0▮▮▮0▮\0\0⁸⁶-#ᶜ5⁶.▤☉😐😐L,、「⁸⁶-#ᶜ6⁶.⁷⁷³³⬇️るヌ$⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0\0ら⁸⁶-#ᶜd⁶.\0\0\0\0\0¹¹³⁶-#ᶜ1⁶.⁸⁸「「p`\0\0⁸⁶-#ᶜ5⁶.▮1bf😐…ナら⁸⁶-#ᶜ6⁶.\0\0¹¹³ᶠ「0⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0⁷ᶠ⁸⁶-#ᶜd⁶.ナら██\0\0\0\0²1ᶜ5⁶.\0\0\0⁴`x⁸\0⁸⁶-#ᶜ6⁶.fF^z「\0\0¹⁸⁶-#ᶜ7⁶.███\0\0\0\0\0⁸⁶-#ᶜd⁶.」9!▒▒▒¹\0⁶-#ᶜ1⁶.\0\0\0 0??゜⁸⁶-#ᶜ2⁶.\0\0█ららら@`⁸⁶-#ᶜ5⁶.█らp▮⁶\0\0\0⁸⁶-#ᶜ7⁶.ᶠ³¹\0\0\0\0\0⁸⁶-#ᶜd⁶.p<ᵉᶠ	\0\0\0⁶-#ᶜ2⁶.³¹\0\0\0\0\0\0    \n   ᶜ9⁶.◜ュ`\0\0\0\0\0⁶.³³\0\0\0\0\0\0⁶-#ᶜ1⁶.ュュヲナら██\0⁸⁶-#ᶜ2⁶.³²⁴⁸\0\0\0\0⁸⁶-#ᶜ5⁶.\0\0\0\0 ``き⁸⁶-#ᶜ6⁶.\0\0\0\0▮\0\0@⁸⁶-#ᶜd⁶.\0\0\0▮\0\0\0\0⁶-#ᶜ1⁶.???!!ppユ⁸⁶-#ᶜ2⁶.\0\0\0▮\0¹\0\0⁸⁶-#ᶜ5⁶.@らら\0\0\0\0\0⁸⁶-#ᶜd⁶.█\0\0ろろ█░\0²5ᶜ6⁶.、、ᶜᶜ\0\0000▮⁸⁶-#ᶜ7⁶.ナナナナら\0\0\0⁸⁶-#ᶜd⁶.³³□■」•ᵇᵇ²5ᶜ6⁶.ユ0000@II⁸⁶-#ᶜ7⁶.ᶠᶠ\r\r⁸\0\0\0⁸⁶-#ᶜd⁶.\0らる🐱♥🐱●●⁶-#ᶜ1⁶.ュュュうᵉ⁷³³⁸⁶-#ᶜ5⁶.\0\0\0¹\0⁸⁴\0⁸⁶-#ᶜ6⁶.³³³²¹\0\0\0⁶-#ᶜ1⁶.。‖ᶜᶜ⁸\0\0\0⁸⁶-#ᶜ2⁶.\"²\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.\0\0\0\0⁴ᶜᶜ」⁸⁶-#ᶜ6⁶.\0⁸■■■■■\0⁶-#     \n     ⁶-#ᶜ5⁶.き███\0\0\0\0⁸⁶-#ᶜ6⁶.@@@@らら█き⁶-#ᶜ1⁶.ユナ\0\0\0\0\0\0⁶-#⁶.¹¹\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.`b◝みた✽▒▒⁸⁶-#ᶜ6⁶.…\0\0F⁶\"²²⁸⁶-#ᶜd⁶.ᵉう\0\0@@DD⁶-#ᶜ5⁶.\0█Cらら███⁸⁶-#ᶜ6⁶./\0█\0\0\0\0\0⁸⁶-#ᶜd⁶.オ○<、\0\0\0\0⁶-#ᶜ1⁶.³²²\0\0\0\0\0⁸⁶-#ᶜ6⁶.\0\0¹¹¹¹¹³⁸⁶-#ᶜd⁶.\0¹\0²²²²\0⁶-#ᶜ5⁶.「⁸⁸「「「⁸⁸⁸⁶-#ᶜ6⁶.¹■▮\0\0\0▮▮⁶-#     \n     ⁶-#ᶜ5⁶.\0\0█\0\0\0\0@⁸⁶-#ᶜ6⁶.き█\0\0\0\0\0█⁶-#ᶜ5⁶.\0\0\0\0\0▮⁸\0⁸⁶-#ᶜ6⁶.\0\0\0\0\0\0\0フ⁸⁶-#ᶜd⁶.\0\0\0\0\0ナユ「⁶-#ᶜ1⁶.\0\00008「\0\0\0⁸⁶-#ᶜ2⁶.\0\0\0\0 0 \0⁸⁶-#ᶜ5⁶.████▒☉……⁸⁶-#ᶜ6⁶.²²²²²\0\0\0⁸⁶-#ᶜd⁶.DDDDDGOo⁶-#ᶜ1⁶.\0\0◝⁷\0\0\0\0⁸⁶-#ᶜ2⁶.\0\0\0\0\0pヨナ⁸⁶-#ᶜ6⁶.\0\0\0\0\0⁸⁸、⁸⁶-#ᶜd⁶.\0\0\0ヲ◝♥⁶³⁶-#ᶜ6⁶.³³⁷゜○◝◝³⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0\0█⁸⁶-#ᶜ8⁶.\0\0\0\0\0\0\0|⁶-#ᶜ5⁶.\0\0\0▮\0\0\0\0⁸⁶-#ᶜ6⁶.▮▮▮\0\0¹⁷ᶠ⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0\0▮⁶-#     \n  ᶜ1⁶.\0\0\0\0\0\0らユ⁶.\0\0\0\0ユ◝◝◝⁶-#⁶.\0\0\0ᵉ??○\0⁸⁶-#ᶜ2⁶.\0\0\0\0\0\0\0◝⁸⁶-#ᶜ5⁶.\0 ▮\0\0@█\0⁸⁶-#ᶜ6⁶.\0ら█▮\0\0\0\0⁸⁶-#ᶜ7⁶.\0\0`ナら█\0\0⁶-#ᶜ5⁶.³\0\0\0\0\0\0¹⁸⁶-#ᶜ6⁶.ュ◝◝◝゛「ユら⁸⁶-#ᶜ7⁶.\0\0\0\0¹⁷ᶠ>⁶-#ᶜ5⁶.\0\0█\0\0゜³ᶜ⁸⁶-#ᶜ6⁶.◝◝qq゜\0、3⁸⁶-#ᶜd⁶.\0\0\0██\0██²5ᶜ6⁶.¹¹\0▮「」il⁸⁶-#ᶜd⁶.^||mフヒ⁶³²5ᶜ2⁶.ナ`0▮\0\0\0\0⁸⁶-#ᶜ6⁶.゛゛ᵉ🅾️\0\0\0\0⁸⁶-#ᶜ7⁶.\0\0\0\0ᶜᶜ⁸「⁸⁶-#ᶜ8⁶.\0█ら`ユユユナ⁸⁶-#ᶜd⁶.\0\0\0\0³²⁶⁴²6ᶜ7⁶.\0\0\0\0\0\0「ヲ⁸⁶-#ᶜ8⁶.ュリニワ◝◝フ⁷⁶-#ᶜ6⁶.⁷⁶⁴\0\0\0\0\0⁸⁶-#ᶜ7⁶.xヲッ◜◜◜◝◝⁸⁶-#ᶜ8⁶.\0¹¹¹¹¹\0\0⁶-#ᶜ1⁶.\0ヲナ█\0\0\0\0⁸⁶-#ᶜ7⁶.\0¹⁷゜○リれ♥⁸⁶-#ᶜ8⁶.\0\0\0\0\0ᶜ<x⁶-#ᶜ1⁶.\0⁷◝◝◜ヲ█\0⁸⁶-#ᶜ2⁶.\0\0\0\0\0\0\0█⁸⁶-#ᶜ7⁶.\0\0\0\0\0¹⁷゜⁶-#ᶜ1⁶.\0\0\0⁷゜?○ュ⁸⁶-#ᶜ2⁶.\0\0\0\0\0\0\0³⁶-#  \n ᶜ1⁶.\0\0\0\0██\0\0⁶-#⁶.ュ◜○???○◝⁸⁶-#ᶜ2⁶.\0\0█ららら█\0²1⁶.ヲ◜゜³¹³゜◜⁸⁶-#ᶜ4⁶.\0\0ナ、⁶、ナ\0⁸⁶-#ᶜ9⁶.\0\0\0ナヲナ\0\0²2ᶜ4⁶.\0\0゜◜ヲ◜゜\0⁸⁶-#ᶜ9⁶.\0\0\0¹⁷¹\0\0²2ᶜ4⁶.\0\0\0\0¹\0\0\0⁸⁶-#ᶜ5⁶.²\0⁴⁸\0\0\0\0⁸⁶-#ᶜ6⁶.█⁴⁸\0\0\0\0\0⁸⁶-#ᶜ7⁶.|ヲユナら█\0\0⁸⁶-#ᶜd⁶.\0\0\0▮8|◜◝⁶-#ᶜ5⁶.\0 ら\0\0\0\0\0⁸⁶-#ᶜ6⁶.aP \0\0\0\0\0⁸⁶-#ᶜ7⁶.\0¹゜゜ᶠᶠゆヲ⁸⁶-#ᶜd⁶.██\0\0\0\0¹⁷⁶-#ᶜ1⁶.\0\0██らナユ>⁸⁶-#ᶜ5⁶.█▤A@ ▮⁸\0⁸⁶-#ᶜ6⁶.d`>⁴\0\0\0\0⁸⁶-#ᶜ7⁶.\0\0\0:゜ᶠ⁷¹⁸⁶-#ᶜd⁶.•⁷\0\0\0\0\0ら⁶-#ᶜ1⁶.\0¹³³⁷ᶠ\r⁸⁸⁶-#ᶜ5⁶.³²⁴⁴⁸\0▮ユ⁸⁶-#ᶜ7⁶.ルヲヲユユユ`\0⁸⁶-#ᶜd⁶.⁸\0\0\0\0\0²⁷⁶-#ᶜ1⁶.\0\0\0\0\0\0000⁷⁸⁶-#ᶜ5⁶.\0\0\0\0\0ユ◆`⁸⁶-#ᶜ6⁶.\0らユ\0\0\0\0\0⁸⁶-#ᶜ7⁶.ュ?ᶠ◝◝ᶠ\0\0⁸⁶-#ᶜ8⁶.³\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0@「⁶-#ᶜ1⁶.\0\0\0\0█◜◝◜⁸⁶-#ᶜ5⁶.\0\0\0ら⁶¹\0\0⁸⁶-#ᶜ6⁶.ュᶠ¹\0\0\0\0\0⁸⁶-#ᶜ7⁶.³ユ◜?¹\0\0\0⁶-#ᶜ1⁶.\0\0\0\0\0◝◝◝⁸⁶-#ᶜ2⁶.\0\0\0ヘュ\0\0\0⁸⁶-#ᶜ4⁶.\0\0█\0\0\0\0\0⁸⁶-#ᶜ5⁶.\0█ᶜ\0\0\0\0\0⁸⁶-#ᶜ7⁶.◝○³\0\0\0\0\0⁶-#ᶜ1⁶.\0\0\0\0█◝◝◝⁸⁶-#ᶜ2⁶.█\0\0\0ᶠ\0\0\0⁸⁶-#ᶜ4⁶.\0☉🅾️⁷\0\0\0\0⁸⁶-#ᶜ5⁶.\0¹\0\0\0\0\0\0⁸⁶-#ᶜ7⁶.⁷\0\0\0\0\0\0\0⁸⁶-#ᶜ9⁶.\0\0pヲp\0\0\0⁶-#ᶜ1⁶.ヲユヲ|?゜⁷\0⁸⁶-#ᶜ2⁶.\0⁸⁶³\0\0\0\0⁸⁶-#ᶜ4⁶.\0\0¹\0\0\0\0\0⁸⁶-#ᶜ9⁶.⁷⁷\0\0\0\0\0\0⁶-#ᶜ1⁶.¹¹\0\0\0\0\0\0 \n  ⁶.◜ュユら\0\0\0\0⁶-#⁶.⁷◝◝◝◝ユ\0\0⁸⁶-#ᶜ2⁶.ヲ\0\0\0\0\0\0\0⁶-#ᶜ1⁶.\0\0◝◝◝◝◜\0⁸⁶-#ᶜ2⁶.◝◝\0\0\0\0\0\0⁶-#ᶜ1⁶.\0\0゜◝◝◝◝\0⁸⁶-#ᶜ2⁶.¹⁷\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.\0\0 \0\0\0\0\0⁸⁶-#ᶜd⁶.◜ヲら\0\0\0\0\0⁶-#ᶜ1⁶.\0\0\0\0ᶠ?¹\0⁸⁶-#ᶜ5⁶.\0\0\0¹▮█\0\0⁸⁶-#ᶜ6⁶.\0\0\0vナ\0\0\0⁸⁶-#ᶜ7⁶.ユ`\0\0\0\0\0\0⁸⁶-#ᶜd⁶.ᶠか◝☉\0\0\0\0⁶-#ᶜ1⁶.゛⁶\0\0\0\0³゛⁸⁶-#ᶜ5⁶.\0\0\0\0\0\0⁴ ⁸⁶-#ᶜ6⁶.\0\0\0¹◝◝ヲら⁸⁶-#ᶜ7⁶.¹\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.ナン◝◜\0\0\0\0²1ᶜ2⁶.\0\0\0\0█@ナ█⁸⁶-#ᶜ4⁶.\0\0\0\0\0█\0\0⁸⁶-#ᶜ6⁶.\0\0ぬ◜○?ᶠ⁷⁸⁶-#ᶜd⁶.ᶠ◝O¹\0\0\0\0⁶-#ᶜ1⁶.\0\0<◜ナ██ナ⁸⁶-#ᶜ2⁶.\0\0\0\0▮``゜⁸⁶-#ᶜ4⁶.\0\0\0\0ᶠ¹¹\0⁸⁶-#ᶜ5⁶.▮ᶜ²¹\0\0\0\0⁸⁶-#ᶜ6⁶.\0\0¹\0\0\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0゛゛\0⁸⁶-#ᶜd⁶.ᶠ³\0\0\0\0\0\0⁶-#ᶜ1⁶.ら\0\0¹れワリり⁶.◝\0\0\0゜○○゜⁶.⁷\0\0\0\0\0\0\0   \n        ⁶.ら\0\0\0\0\0\0\0⁶.?\0\0\0\0\0\0\0      \n                "
hallway="⁶-b⁶x8⁶y8⁶-#ᶜ1⁶.¹ナうᶜ⁶²²²⁸⁶-#ᶜ2⁶.\0\0`ユヲュチう⁸⁶-#ᶜ4⁶.\0\0\0\0\0\0 `⁶-#ᶜ1⁶.\0	?G⬇️⬇️³⁷⁸⁶-#ᶜ2⁶.\0\0\0008|\\う☉⁸⁶-#ᶜ4⁶.\0\0\0\0\0 `p⁶-#ᶜ1⁶.\0\0ナら\0aれ◆⁶.\0\0る¹⬇️²17⁶.ュッッネニチサら⁶.も}ャリワ◝◝◝⁶.リラヒヤヤトトよ²1   ⁶-#⁶.⁷sャK³⁷フネ⁶.\0ヌマユヲ¹¹フ⁶.\0⁷リャンら\0゜⁶.\0\0\0³¹らユヲ⁶-#⁶.\0█ルヌりりらナ⁸⁶-#ᶜ2⁶.\0\0\0、>:9■⁸⁶-#ᶜ4⁶.\0\0\0\0\0⁴⁶ᵉ⁶-#ᶜ1⁶.\0¹¹\0\0\0\0@⁸⁶-#ᶜ2⁶.\0\0⁶ᶠ゜゜;9⁸⁶-#ᶜ4⁶.\0\0\0\0\0\0⁴⁶\n⁶-#ᶜ1⁶.²²²²🐱⁴\0⬇️⁸⁶-#ᶜ2⁶.,ᶜ、⬆️|⁸\0\0⁸⁶-#ᶜ4⁶.オユナh\0\0\0\0⁶-#ᶜ1⁶.♥えョナ████⁸⁶-#ᶜ2⁶.x`\0、~>7?⁸⁶-#ᶜ4⁶.\0\0\0\0\0\0⁸\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0@@@⁶-#ᶜ1⁶.ᶠ⁷⁴⁴⁴\0ᶜ゜⁸⁶-#ᶜ2⁶.0xャャみンリナ⁸⁶-#ᶜ4⁶.\0\0\0\0B⁶\0\0⁶-#ᶜ1⁶.ᶠ⁶\0H0ヘヲ☉⁸⁶-#ᶜ2⁶.\0\0\0¹³⁴⁶■⁸⁶-#ᶜ4⁶.\0\0\0\0\0³¹⁶⁸⁶-#ᶜ5⁶.\0っ「▮\0\0\0\0⁶-#ᶜ1⁶.█\0█0⁸\0ん◝⁸⁶-#ᶜ5⁶.\0か▮⁸\0\0\0\0⁶-#ᶜ1⁶.ョヌ◝ュ◜ュンャ⁸⁶-#ᶜ5⁶.²。\0²\0\0\0\0²1⁶.\0◝\0\0\0\0\0\0²1⁶.\0웃\0\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0◜ユユらら@²1ᶜ5⁶.\0ト\0\0\0\0\0、⁸⁶-#ᶜd⁶.\0\0?⁷⁷\0\0¹⁶-#ᶜ1⁶.◝◝◝◝◝◝よよ⁶-#⁶.」⁵◜>◝◝◝◝⁸⁶-#ᶜ5⁶.\0008\0ら\0\0\0\0⁶-#ᶜ1⁶.!\0▒\na¹³か⁸⁶-#ᶜ5⁶.らヘ⁶¹\0\0\0\0⁶-#ᶜ1⁶.★\0¹▮\0\0¹▮⁸⁶-#ᶜ2⁶.\0\0\0██ `☉⁸⁶-#ᶜ4⁶.\0\0\0\0\0ら█`⁸⁶-#ᶜ5⁶.\rᶠ\0⁸\0\0\0\0⁶-#ᶜ1⁶.ユナ   \0000ヲ⁸⁶-#ᶜ2⁶.ᶜ゛トトえかエ⁷⁸⁶-#ᶜ4⁶.\0\0\0\0B`\0\0²1ᶜ2⁶.゛⁶\0008~|ムュ⁸⁶-#ᶜ4⁶.\0\0\0\0\0\0▮\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0²²²⁶-#ᶜ1⁶.らら@@¹³◆ヤ⁸⁶-#ᶜ2⁶.408)>、\0\0⁸⁶-#ᶜ4⁶.ᵇᶠ⁷◀\0\0\0\0\n⁶-#ᶜ1⁶.ん◜ュユナら\0\0⁸⁶-#ᶜ2⁶.\0¹³ᶠ゜'³³⁸⁶-#ᶜ4⁶.\0\0\0\0\0「\\ュ⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0き\0²1ᶜ2⁶.ᶠᶠO>゛ナナ@⁸⁶-#ᶜ4⁶.Pp0\0\0\0\0█⁸⁶-#ᶜ9⁶. \0\0\0\0\0\0¹²1ᶜ2⁶.っ⁴ᶜ,|やめ▤⁸⁶-#ᶜ4⁶.\0「▮▮\0\0\0³⁶-#ᶜ1⁶.⁸◆⁷Op```⁸⁶-#ᶜ2⁶.7P80◆🐱⬇️●⁸⁶-#ᶜ4⁶.\0 ら█\0。「■⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0⁴⁸⁶-#ᶜ1⁶.◝◝ュx0「0ぬ⁸⁶-#ᶜ2⁶.\0\0¹\0⁷⁷ᵇ³⁸⁶-#ᶜ4⁶.\0\0\0¹\0\0⁴ᶜ⁸⁶-#ᶜ5⁶.\0\0\0█らら█\0⁶-#ᶜ1⁶.ワワ¹ュᶜロ◝◝⁸⁶-#ᶜ5⁶.\0\0◜³リ	\0\0⁶-#ᶜ1⁶.◝◝ヨワナヤエト⁸⁶-#ᶜ5⁶.\0\0⁶\0⁷\0\0\0²1ᶜ4⁶.\0\0\0\0\0\0\0⁸⁸⁶-#ᶜ5⁶.\0も\0\0\0\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0\0▮\0⁸\0⁸⁶-#ᶜd⁶.@@█ら@ら██²1ᶜ4⁶.\0\0\0\0\0⁸⁴▮⁸⁶-#ᶜ5⁶.\0ッ\0\0\0\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0⁸⁸⁴⁸⁸⁸⁶-#ᶜd⁶.¹¹\0¹¹¹\0\0⁶-#ᶜ1⁶.トュ◆◝゜◝◝◝⁸⁶-#ᶜ5⁶.\0³p\0ナ\0\0\0²1⁶.\0\0○らエ…\0\0⁶-#ᶜ1⁶.◝○?ᵉᶜ⁘ᵉ	⁸⁶-#ᶜ2⁶.\0\0\0\0らナオら⁸⁶-#ᶜ4⁶.\0\0\0█\0\0 0⁸⁶-#ᶜ5⁶.\0\0\0¹³³¹\0⁶-#ᶜ1⁶.▮ユナラᵉ⁶⁶⁶⁸⁶-#ᶜ2⁶.ヘ\n、ᶜヨAりa⁸⁶-#ᶜ4⁶.\0⁴³¹\0ま「☉⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0 ▮²1ᶜ2⁶.⁙ 04>やツ」⁸⁶-#ᶜ4⁶.\0「⁸⁸\0\0\0ら²1ᶜ2⁶.ユユラ|x⁷⁷²⁸⁶-#ᶜ4⁶.\nᵉᶜ\0\0\0\0¹⁸⁶-#ᶜ9⁶.⁴\0\0\0\0\0\0█⁶-#ᶜ1⁶.ヤs?ᶠ⁷³\0\0⁸⁶-#ᶜ2⁶.\0█らユヲノらら⁸⁶-#ᶜ4⁶.\0\0\0\0\0「:?⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0⁵\0\n²2ᶜ4⁶.ヲユユ\0000 Hナ⁶-#ᶜ1⁶.2;GGわわイメ⁸⁶-#ᶜ2⁶.ららまま880▮⁸⁶-#ᶜ9⁶.¹\0\0\0\0\0\0\0²1ᶜ2⁶.スオくᶜ、<<|⁸⁶-#ᶜ4⁶.³³\0\0\0\0\0\0⁶-#ᶜ1⁶. `p{○○◝セ⁸⁶-#ᶜ2⁶.ト♥◆░██\0⁶⁸⁶-#ᶜ4⁶.\0「\0\0\0\0\0\0⁶-#ᶜ1⁶.``ユき    ⁸⁶-#ᶜ2⁶.³♥ᵉVシトれん⁸⁶-#ᶜ4⁶.、「¹¹⁸\0⁴⁸⁸⁶-#ᶜ9⁶.\0\0\0⁸\0\0「▮⁶-#ᶜ1⁶.◝ユ\0@\0\0⁸▮⁸⁶-#ᶜ2⁶.\0\0\0³⁶⁴\0⁸⁸⁶-#ᶜ4⁶.\0\0\0\0¹²¹³⁸⁶-#ᶜ5⁶.\0\0\0██\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0¹⁶⁴⁶-#ᶜ1⁶.⁷◝█⁶ュ>?⁴⁸⁶-#ᶜ5⁶.\0\0~ン³ら\0\0⁶-#ᶜ1⁶.⬇️³¹\n゜リユ¹⁸⁶-#ᶜ4⁶.<<\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.\0\0\0⁵\0\0\0\0⁸⁶-#ᶜd⁶.@ら◜ユナ\0\0\0⁶-#ᶜ1⁶.らナらXお?◝\0⁸⁶-#ᶜ4⁶.゛゛\0\0\0\0\0\0⁸⁶-#ᶜ5⁶. \0\0き\0\0\0\0⁸⁶-#ᶜd⁶.¹¹?⁷¹\0\0\0⁶-#ᶜ1⁶.◝\0¹`▮|◝ヲ⁸⁶-#ᶜ5⁶.\0\0⁴から⬇️\0\0⁶-#ᶜ1⁶.◝|\0ᵉ⁴□」⁸⁸⁶-#ᶜ2⁶.\0\0██` \0⁘⁸⁶-#ᶜ4⁶.\0\0\0\0█@█ら⁸⁶-#ᶜ5⁶.\0\0\0¹³¹\0\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0█` ⁶-#ᶜ1⁶.⁴⁶ᶠ⁵⁴⁴⁴⁴⁸⁶-#ᶜ2⁶.らナpjミャれネ⁸⁶-#ᶜ4⁶.8「██▮\0 ▮⁸⁶-#ᶜ9⁶.\0\0\0▮\0\0「⁸⁶-#ᶜ1⁶.⁴⁶ᵉテッッヨ▥⁸⁶-#ᶜ2⁶.ャニヨ!¹¹\0`⁸⁶-#ᶜ4⁶.\0「\0\0\0\0\0\0²1ᶜ2⁶.•ᵇ✽08<<>⁸⁶-#ᶜ4⁶.らら\0\0\0\0\0\0²1ᶜ2⁶.³³。。、、ᶜ⁸⁸⁶-#ᶜ9⁶.█\0\0\0\0\0\0\0²2ᶜ4⁶.゜ᶠᶠ\0ᶜ⁴□⁷\n⁶-#ᶜ1⁶.█@ぬよかOOG⁸⁶-#ᶜ2⁶.゜⁷ᶠ\0\0███⁸⁶-#ᶜ4⁶.`8\0\0\0\0\0\0⁶-#ᶜ1⁶.ヲるトレナら@@⁸⁶-#ᶜ2⁶.\0\0\0\n゜ᵇ⁴⁷⁸⁶-#ᶜ4⁶.\0\0\0\0\0004;8²1ᶜ2⁶.8¥🐱ヌvロララ⁸⁶-#ᶜ4⁶.\0\0\0\0█\0\0\0⁶-#ᶜ1⁶.ね00``ナきき⁸⁶-#ᶜ2⁶.ᵉᵇ	⁙³■PE⁸⁶-#ᶜ4⁶.\0⁴⁶\0ᶜᵉᶠ¥⁸⁶-#ᶜ9⁶.\0\0\0ᶜ▮\0\0\0⁶-#ᶜ1⁶.#よ~qね1ニ!⁸⁶-#ᶜ2⁶.ろ@█🅾️Jウ◀る⁸⁶-#ᶜ4⁶.「\0\0\0⁴\0⁸ᶜ⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0\0▮⁶-#ᶜ1⁶.▮■□▮カ•゜$⁸⁶-#ᶜ2⁶.	 )/*$`•⁸⁶-#ᶜ4⁶.⁶ᵉD@⁴@\0\0⁶-#ᶜ1⁶.゜゜\0⁶▮\0\0\0⁶.゜?@\0\0\0\0\0⁶-#⁶.っヤ⁶8\0らユま⁸⁶-#ᶜa⁶.\0\0\0\0\0\0\0@⁶-#ᶜ1⁶.w3█らりれC³⁶-#⁶.⁸☉@\0⬇️スヲ'⁸⁶-#ᶜ2⁶.⬆️⁵⬆️ルT%⁶ス⁸⁶-#ᶜ4⁶.br#³ ²\0\0⁶-#ᶜ1⁶.ろ=~🅾️♪😐♥░⁸⁶-#ᶜ2⁶.#²¹qRshC⁸⁶-#ᶜ4⁶.「\0\0\0 \0▮0⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0\0⁸⁶-#ᶜ1⁶.웃⁸\r⁵⁷⁷⁵⁵⁸⁶-#ᶜ2⁶.pオ…っら☉\nけ⁸⁶-#ᶜ4⁶.\0 `\0000pユX⁸⁶-#ᶜ9⁶.\0\0\0000⁸\0\0\0⁶-#ᶜ1⁶.ネせゆま……ぬ0⁸⁶-#ᶜ2⁶.、XAGnoOO⁸⁶-#ᶜ4⁶.\0\0\0\0¹\0\0\0⁶-#ᶜ1⁶.◝◝◝に⁷²²²⁸⁶-#ᶜ2⁶.\0\0\0Pヲオ ナ⁸⁶-#ᶜ4⁶.\0\0\0\0\0,チ、²1ᶜ2⁶.ヲナユ\0\0¹¹¹⁸⁶-#ᶜ4⁶.⁶、\0\0\0\0\0\0\n⁶-#ᶜ1⁶.GM…きら█\0\0⁸⁶-#ᶜ2⁶.█🐱ᶠ゜;B●ᶠ⁸⁶-#ᶜ4⁶.\0\0\0\0⁴=yユ²1ᶜ2⁶.゜゜゜ᵉ\0ナユq⁸⁶-#ᶜ4⁶. \0\0\0\0\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0\0█⁶-#ᶜ1⁶.\r。○ャンン⁸\n⁸⁶-#ᶜ2⁶.ラヌ█\0\0\0ねヨ⁸⁶-#ᶜ4⁶.\0\0\0\0\0\0@\0²1ᶜ2⁶.ゃイ♥██⁸▤1⁸⁶-#ᶜ4⁶.⁶²\0\0\0▮!²⁶-#ᶜ1⁶.#>80ぬナ`ま⁸⁶-#ᶜ2⁶.ろ▒♥ゃA¹⬇️⁷⁸⁶-#ᶜ4⁶.⁸@@⁶ᵉ゛、\0⁸⁶-#ᶜ9⁶.▮\0\0\0\0\0\0\0⁶-#ᶜ1⁶.D☉☉にᶠ▮▮「⁸⁶-#ᶜ2⁶.▥A!\0\0-ig⁸⁶-#ᶜ4⁶.²²⁶@\0²⁶\0⁸⁶-#ᶜ9⁶.\0⁴@\0\0\0\0\0⁶-#ᶜ1⁶.¹³³³\0\0¹▒⁶-#⁶.\0\0らナ0▮」•⁸⁶-#ᶜ3⁶.\0\0\0\0らナ\0 ⁶-#ᶜ1⁶.まアイ◆ウュス▤⁸⁶-#ᶜ2⁶.\0\0\0\0¹²$ ⁸⁶-#ᶜ3⁶.\0\0\0\0\0¹³⁶⁸⁶-#ᶜ4⁶.\0\0\0p0\0\0\0⁸⁶-#ᶜ9⁶.@ 0\0\0\0\0\0⁸⁶-#ᶜa⁶.\0▮\0\0\0\0\0\0⁶-#ᶜ1⁶.³▒▒█\0\0██⁶-#⁶.&」」ョ◜ᵇ	「⁸⁶-#ᶜ2⁶.▥●░\0\0ひ∧フ⁸⁶-#ᶜ4⁶.@@`²\0@`\0⁸⁶-#ᶜ9⁶.\0 ²\0\0\0\0\0⁶-#ᶜ1⁶.ろ|、⁸	⁷⁴•⁸⁶-#ᶜ2⁶.#▒ニ⧗🐱█りナ⁸⁶-#ᶜ4⁶.▮²²`px8\0⁸⁶-#ᶜ9⁶.⁸\0\0\0\0\0\0\0⁶-#ᶜ1⁶.ᶜᶜ゛◜ュフb1⁸⁶-#ᶜ2⁶.⧗はニ¹¹▮」😐⁸⁶-#ᶜ4⁶.`@\0\0\0⁸░@⁶-#ᶜ1⁶.08~ᶠかトPp⁸⁶-#ᶜ2⁶.OG¹\0\0\0♪◆⁸⁶-#ᶜ4⁶.\0\0\0\0\0\0²\0⁶-#ᶜ1⁶.²⁴⁴▒リヲユp⁸⁶-#ᶜ2⁶.ヲヲヲp\0⁷ᶠ🅾️⁸⁶-#ᶜ4⁶.⁴\0\0\0\0\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0\0¹²1ᶜ2⁶.¹AユヲチBaユ⁸⁶-#ᶜ4⁶.\0\0\0\0 もおᶠ\n²2⁶.ロユユ`\0\0ら▮²2ᶜ1⁶.⁶⁶⁶⁶⁶⁶ᵉ゜⁸⁶-#ᶜ4⁶.█ █らら\0\0\0⁶-#ᶜ1⁶.\n⁶⁴⁴⁴ᵉᵉ゜⁸⁶-#ᶜ2⁶.ぬxzッッヨヨナ⁸⁶-#ᶜ4⁶.@██¹¹\0\0\0⁸⁶-#ᶜ9⁶.¹¹¹\0\0\0\0\0⁶-#ᶜ1⁶.ヲユナ@P▮\0ら⁸⁶-#ᶜ2⁶.⁷\0\0█▒りエᶠ⁸⁶-#ᶜ4⁶.\0	‖⁙ᵉᵉ\0\0⁸⁶-#ᶜ9⁶.\0⁶\nᶜ\0\0\0\0⁶-#ᶜ1⁶.♥◆ぬユぬ88<⁸⁶-#ᶜ2⁶.\0\0ᶠ\rBCれれ⁸⁶-#ᶜ4⁶.\0\0\0²	⁴⁴\0⁸⁶-#ᶜ9⁶.\0\0\0\0⁴█\0\0⁶-#ᶜ1⁶.?ぬ▮@H_P▮⁸⁶-#ᶜ2⁶.\0³れ✽♥█\0³⁸⁶-#ᶜ4⁶.\0ᶜᶜ\n\0\0ᶜᶜ⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0³\0⁶-#ᶜ1⁶.らりり▒▒█\0\0⁶-#⁶.゜<、\r」•ᵇ³⁸⁶-#ᶜ3⁶.\0\0 0\0\0\0\0⁸⁶-#ᶜ5⁶.\0¹¹²²\0\0\0⁶-#ᶜ1⁶.▤チっ@@`00⁸⁶-#ᶜ3⁶.\0\0⁶ᶜ\0\0\0\0⁶-#ᶜ1⁶.らら\0\0@ナ`\0⁶-#⁶.ワ¹ᶜᶜ¥ッᵉ\r⁸⁶-#ᶜ2⁶.\0ららきハ⁴\0る⁸⁶-#ᶜ4⁶.\00000P\0\00000⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0ら\0⁶-#ᶜ1⁶.ヲンᵇᵇ	、、<⁸⁶-#ᶜ2⁶.\0\0ユぬBるれれ⁸⁶-#ᶜ4⁶.\0\0\0@…  \0⁸⁶-#ᶜ9⁶.\0\0\0\0 ¹\0\0⁶-#ᶜ1⁶.。ᶜ¹⁶ᵉᶜᶜᶠ⁸⁶-#ᶜ2⁶.ナ\0\0¹▒⬇️リユ⁸⁶-#ᶜ4⁶.\0…そっpp\0\0⁸⁶-#ᶜ9⁶.\0`P0\0\0\0\0²1ᶜ2⁶.\r゛^__◆◆⁷⁸⁶-#ᶜ4⁶.²¹¹██\0\0\0⁸⁶-#ᶜ9⁶.███\0\0\0\0\0²1ᶜ2⁶.おいおううか◆⁷⁸⁶-#ᶜ4⁶.¹⁴¹³³\0\0\0²2⁶.oᶠᶠ⁶\0\0³⁸\n⁶-#ᶜ1⁶.\0█らニ○80 ⁸⁶-#ᶜ2⁶.◝○?゛█んエり²1⁶.ら`ヌgヤヘろ█⁸⁶-#ᶜ4⁶.\0█\0█\0⁷ᵇ゜⁶-#ᶜ1⁶.「0ナナナp( ⁸⁶-#ᶜ2⁶.フア■□▶♪んん⁸⁶-#ᶜ4⁶.\0³ᵉ\r⁸²\0\0⁶-#ᶜ1⁶.☉ヌめく   き⁸⁶-#ᶜ2⁶.⁷¹@F⬇️CFG⁸⁶-#ᶜ4⁶.\0\0\0\0L😐▥「⁸⁶-#ᶜ9⁶.\0\0\0「▮▮\0\0⁶-#ᶜ1⁶.wgニヨヨ9?8⁸⁶-#ᶜ2⁶.☉█⁶\nᵉ⁶ら@⁸⁶-#ᶜ4⁶.\0「「⁴\0\0\0█⁶-#ᶜ1⁶.0ᶜ⁷aDᶜ⁴⁴⁸⁶-#ᶜ2⁶.⁵³ \0  \0ᵇ⁸⁶-#ᶜ4⁶.\n\0@\0\0³ᵇ\0⁶-#ᶜ1⁶.\0\0\0\0\0◜ユナ⁶.□◀◀⁘⁴ᶠᶠ◆⁶.0   `@ネリ⁶-#⁶.ら\0ナナ@█⁷」⁸⁶-#ᶜ2⁶.\0\0\0\0█\0\0\0⁶-#ᶜ1⁶.ᶠ █🅾️ち;)(⁸⁶-#ᶜ2⁶.きら⁴¹⁵⁴⁴サ⁸⁶-#ᶜ4⁶.P\0³\0@らキ\0⁶-#ᶜ1⁶.モヒ✽♪웃…ユル⁸⁶-#ᶜ2⁶.■¹`Ppa³²⁸⁶-#ᶜ4⁶.\0「「 \0\0\0¹²1ᶜ2⁶.ナ█²bりるbヌ⁸⁶-#ᶜ4⁶.\0\0\0\00021▥「⁸⁶-#ᶜ9⁶.\0\0\0「⁸⁸\0\0²1ᶜ2⁶.フ3☉Hヘねネネ⁸⁶-#ᶜ4⁶.\0らpぬ▮@\0\0²1ᶜ2⁶.³⁶Gヒワ▶#¹⁸⁶-#ᶜ4⁶.\0¹\0¹\0ナオヲ²1ᶜ2⁶.◝◜ュx¹ネリリ\n⁶-#ᶜ1⁶.\0\0\0pも◝◝'⁸⁶-#ᶜ2⁶.@\0\0\0\0\0\0\0⁸⁶-#ᶜ4⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜb⁶.\0\0\0\0\0\0\0ス⁶-#ᶜ1⁶.ナナ`0 ³⁷゜⁸⁶-#ᶜ2⁶.¹\0█ららら\0\0⁸⁶-#ᶜ4⁶.゛゛、⁸\0\0\0\0⁶-#ᶜ1⁶.⁷▶、▮ナナナ`⁸⁶-#ᶜ2⁶.ナナネネ⁙\r\r☉⁸⁶-#ᶜ4⁶.\0\0\0ᶜ⁸□▮▮⁸⁶-#ᶜ9⁶.\0\0\0\0⁴\0²⁶⁶-#ᶜ1⁶.`き…😐♥Gメヲ⁸⁶-#ᶜ2⁶.゜」osxま□⁷⁸⁶-#ᶜ4⁶.\0⁶\0\0\0\0\0\0⁶-#ᶜ1⁶.:1きナ`1>?⁸⁶-#ᶜ2⁶.ろるC⁷えアA\0⁸⁶-#ᶜ4⁶.\0ᶜ、「²²\0\0⁶-#ᶜ1⁶.⁴⁶▶ヲ\0ユヲ◜⁸⁶-#ᶜ2⁶.³¹\0³¹\0\0\0⁸⁶-#ᶜ4⁶.⁸\0\0\0\0\0\0\0⁶-#ᶜ1⁶.◝◜~◝◜◝◝◝⁶.かᶠ⁴⁷³	\r。⁶.ワららら██\0▮⁶-#⁶.⁷◝◝♥○◝ョ◝⁸⁶-#ᶜ5⁶.\0\0\0\0\0\0²\0⁶-#ᶜ1⁶.,hン1\0ᶠ?○⁸⁶-#ᶜ2⁶.ら…\0らら█\0\0⁸⁶-#ᶜ4⁶.▮\0\0\0\0\0\0\0⁶-#ᶜ1⁶.チ😐⁵⁷⁶😐、ノ⁸⁶-#ᶜ2⁶.#Cるナみ3⬇️²⁸⁶-#ᶜ4⁶.\00008「@@\0\0²1ᶜ2⁶.ヲ▤ロウ゛。Hナ⁸⁶-#ᶜ4⁶.\0`\0\0\0\0\0\0⁶-#ᶜ1⁶.ヲヲ「⁸⁷⁷⁷⁶⁸⁶-#ᶜ2⁶.⁷⁷ん♥☉……■⁸⁶-#ᶜ4⁶.\0\0\0▮▮⁸⁸☉²1ᶜ2⁶.██▒Cネワ◝◝⁸⁶-#ᶜ4⁶.xxxぬ\0\0\0\0²1ᶜ2⁶.ラヌネヒ゜???⁸⁶-#ᶜ4⁶.¹¹\0¹\0\0\0\0\n²1ᶜ3⁶.\0\0\0█\0\0らヲ⁸⁶-#ᶜb⁶.ヘユユpユヲ<⁶⁶-#ᶜ1⁶.<|ヲュ◜◝゜⁷⁸⁶-#ᶜ3⁶.\0\0\0²\0\0ナヲ⁸⁶-#ᶜb⁶.³³⁷¹¹\0\0\0⁶-#ᶜ1⁶.   0!!``⁸⁶-#ᶜ2⁶.らアオららら██⁸⁶-#ᶜ3⁶.\0\0\0\0\0\0¹³⁸⁶-#ᶜ4⁶.、▮⁸\0\0\0\0\0⁶-#ᶜ1⁶.pナナきぬぬPス⁸⁶-#ᶜ2⁶.█\0¹⁵³ᶠ◆⁷⁸⁶-#ᶜ4⁶.ᶠ゜゛¥ᶜ\0\0\0⁶-#ᶜ1⁶.、」¹れ◜◜◝◝⁸⁶-#ᶜ2⁶.¹⁶⁶⁴¹¹\0\0⁸⁶-#ᶜ4⁶.²\0\0\0\0\0\0\0⁶-#ᶜ1⁶.◝◝ま◝◝◝◝◝⁶.◝◝p○○○?よ⁶-#⁶.=<゛゛゛゛、。⁸⁶-#ᶜ5⁶.\0\0 \0\0\0\0\0⁶-#ᶜ1⁶.ユpユナきナナ█⁸⁶-#ᶜ5⁶.\0█\0\0@\0\0@⁶-#ᶜ1⁶.◝○り◝◝ャ◝◝⁸⁶-#ᶜ5⁶.\0\0\0\0\0⁴\0\0⁶-#ᶜ1⁶.◝◝◝◝/◝◝◝⁶-#⁶. ⧗❎ん`○◝█⁸⁶-#ᶜ2⁶.█``\0██\0\0⁸⁶-#ᶜ4⁶.@\0\0\0\0\0\0\0²1ᶜ2⁶.¹\0█きらユヨナ⁸⁶-#ᶜ4⁶.ユヲxX0\0\0\0⁶-#ᶜ1⁶.⁴⁴⁴ᶜᶜᶜᵉᵉ⁸⁶-#ᶜ2⁶.³⁙ᵇ³³³¹¹⁸⁶-#ᶜ4⁶.「⁸▮\0\0\0\0\0⁸⁶-#ᶜ6⁶.\0@@@@ら██⁸⁶-#ᶜc⁶.\0\0\0\0\0\0@@⁶-#ᶜ1⁶.\0ᶜᶜ、|ュ◜う⁸⁶-#ᶜ2⁶.◝リリヌ🐱²\0`²1⁶.????゜、\0█\n²1ᶜ3⁶.ヲ|アろろノろノ⁸⁶-#ᶜb⁶.⁶²²²²²²²⁸⁶-#ᶜc⁶.\0\000088「8「⁶-#ᶜ1⁶.⁷³\0\0¹¹\0\0⁸⁶-#ᶜ3⁶.「、トヤモ◜○?⁸⁶-#ᶜc⁶.ナナ ▮▮\0\0\0⁶-#ᶜ1⁶.らら██████⁸⁶-#ᶜ2⁶.\0\0\0\0\0\0\0@⁸⁶-#ᶜ3⁶.³³³³³\0\0\0⁸⁶-#ᶜ4⁶.\0\0\0@@@\0\0⁶-#ᶜ1⁶.>3▒らヘル◝◝⁸⁶-#ᶜ2⁶.¹⁸、ᶠ⁷³\0\0⁸⁶-#ᶜ4⁶.\0⁴²\0\0\0\0\0⁶-#ᶜ1⁶.◝ぬ◜◝◝◝◝◝²1ᶜ5⁶.\0\0ら\0\0ヲxp⁶-#ᶜ1⁶.よかかト◝ᵉᶠ◝⁸⁶-#ᶜ5⁶.\0\0\0\0\0ヨユ\0⁶-#ᶜ1⁶.	¹³³⁷ᶠN~⁸⁶-#ᶜ5⁶.\0\0\0\0\0\0¹¹⁶-#ᶜ1⁶.\0\0\0\0\0\0らユ⁸⁶-#ᶜ5⁶.\0\0\0\0█ら\0\0⁶-#ᶜ1⁶.`らスヲリ³⁷⁷⁸⁶-#ᶜ5⁶.う< \0\0000▮\0⁸⁶-#ᶜc⁶.\0\0\0\0\0\0\0█⁶-#ᶜ1⁶.>゜³¹\0\0\0\0⁸⁶-#ᶜ5⁶.¹\0\0\0\0\0\0\0⁸⁶-#ᶜb⁶.\0\0\0\0\0\0\0ナ⁸⁶-#ᶜc⁶.\0\0\0ユヲ◜◝゜⁶-#ᶜb⁶.\0\0\0|チ😐🅾️よ⁸⁶-#ᶜc⁶.\0\0\0³#sq@⁶-#ᶜ1⁶.○ウ░⁸▮ ナら⁸⁶-#ᶜ2⁶.█▮8ユナら\0\0⁸⁶-#ᶜ4⁶.\0 @\0\0\0\0\0⁸⁶-#ᶜb⁶.\0\0\0\0²³⁷⁴⁸⁶-#ᶜc⁶.\0\0\0\0\0\0\0³⁶-#ᶜ1⁶.ᶠ⁷³¹¹¹¹¹⁸⁶-#ᶜ2⁶.\0\0\0▮▮ᶜᵉᵉ⁸⁶-#ᶜ4⁶.\0⁸ᶜᵉᵉ²\0\0⁸⁶-#ᶜ6⁶.████████⁸⁶-#ᶜc⁶.@@@@@@@@⁶-#ᶜ2⁶.ュ░ぬ█らナユユ⁸⁶-#ᶜ4⁶.\0xLx8「⁸⁸⁸⁶-#ᶜ6⁶.\0\0\0\0¹¹¹¹²1ᶜ2⁶.りれんん◆◆゜゜\n⁶-#ᶜ1⁶.¹¹¹¹¹³³²⁸⁶-#ᶜ3⁶.~ウモ◜◜ュュュ⁸⁶-#ᶜc⁶.█0▮\0\0\0\0\0⁶-#ᶜ1⁶.\0\0\0\0\0、<ュ⁸⁶-#ᶜ3⁶.?゜ᶠᶠ⁷³³³⁸⁶-#ᶜ4⁶.█ら██\0\0\0\0⁸⁶-#ᶜ6⁶.\0\0@`ら\0\0\0⁶-#ᶜ1⁶.\0\0\0\0\0\0\0¹⁸⁶-#ᶜ3⁶.\0\0▮0pユナ`⁸⁶-#ᶜ4⁶.\0\0¹¹\0\0\0\0⁸⁶-#ᶜ6⁶.\0\0\0\0³\0\0\0⁸⁶-#ᶜ9⁶.¹¹\0\0\0\0\0\0⁸⁶-#ᶜc⁶.\0\0 @█\0\0\0⁶-#ᶜ1⁶.◝~<<80ナら⁸⁶-#ᶜ3⁶.\0\0\0\0\0\0³ᶠ⁸⁶-#ᶜ5⁶.\0█らららら\0\0⁸⁶-#ᶜc⁶.\0\0\0\0\0¹\0\0²1ᶜ5⁶.\r゜3%;ᶠ\0\0⁶-#ᶜ1⁶.◝◝◝ᶠ¹¹¹³⁸⁶-#ᶜ5⁶.\0\0\0ユ◜~><⁶-#ᶜ1⁶.◝◝◝█ひらヘノ⁸⁶-#ᶜ5⁶.\0\0\0○K>◀¥²1⁶.\0\0ヲュ◜◜>\0⁶-#ᶜ1⁶.◝◝ᶠᶠᶠᶠ?○⁸⁶-#ᶜ5⁶.\0\0ユユユユ@\0⁶-#ᶜ1⁶.⁷³²\0\0\0\0\0⁸⁶-#ᶜ5⁶.\0\0¹¹\0\0\0\0⁸⁶-#ᶜb⁶.█ナナユナ…\0⁴⁸⁶-#ᶜc⁶.`\0\0\0「l◜ャ²3ᶜb⁶.ユャ◝トヤん²█⁸⁶-#ᶜc⁶.ᶠ⁴\0\0\0\0¹¹²3ᶜb⁶.◝ヨユト○◜◝◝⁸⁶-#ᶜc⁶.\0ᵉᶠ \0\0\0\0⁶-#ᶜ1⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜ3⁶.\0\0\0\0,○~◜⁸⁶-#ᶜb⁶.⁸」゜?⁙█▒¹⁸⁶-#ᶜc⁶.⁷⁶\0\0\0\0\0\0⁶-#ᶜ1⁶.³ᶠ⁶⁶⁴⁴\0\0⁸⁶-#ᶜ2⁶.ᶜ\0\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.████████⁸⁶-#ᶜb⁶.\0\0\0\0\0\0¹³⁸⁶-#ᶜc⁶.@````ppp⁶-#ᶜ1⁶.\0\0\0\0⁸8ユ█⁸⁶-#ᶜ2⁶.ヲヲユヲユら⁸「⁸⁶-#ᶜ4⁶.\0\0⁸\0\0\0\0\0⁸⁶-#ᶜ6⁶.¹¹¹¹¹¹¹¹²1ᶜ2⁶.゜゜゜ᶠᶠ³ナヲ\n⁶-#ᶜ1⁶.⁶゛:⁴、「ユナ⁸⁶-#ᶜ3⁶.ヲナろッナナ¹³²1⁶.゜ᶠ♥ん⁷#▮\0⁸⁶-#ᶜb⁶.\0\0\0\0ららナユ⁶-#ᶜ1⁶.⁷⁶⁸(0 \0\0⁸⁶-#ᶜ3⁶.`aフんアオナナ⁸⁶-#ᶜb⁶.\0\0\0\0¹¹¹	⁸⁶-#ᶜc⁶.\0\0\0\0²ᵉ゛◀⁶-#ᶜ1⁶.\0\0⁸<「「80⁸⁶-#ᶜ3⁶.゛>pりニニ¹¹⁶-#ᶜ1⁶.◝ヲヲヲヲx「゛⁸⁶-#ᶜ3⁶.\0\0\0¹¹\0\0\0⁸⁶-#ᶜ5⁶.\0⁶\0\0\0█ナナ⁶-#ᶜ1⁶.゜゜゜ᶠ\0\0\0\0⁸⁶-#ᶜ5⁶. \0\0\0ᶠᶠ⁷⁷⁸⁶-#ᶜ6⁶.\0\0\0\0@@``⁶-#ᶜ1⁶.ヲ◜~○?|ュナ⁸⁶-#ᶜ5⁶.⁶\0██ら⬇️³゜⁶-#ᶜ1⁶.◝◝ヲ\0█ ⁘¹⁸⁶-#ᶜ5⁶.\0\0⁷◝○ト⬇️²⁶-#ᶜ1⁶.○??⁶◀⁶ᶠ゜⁸⁶-#ᶜ5⁶.\0\0\0009)90 ⁸⁶-#ᶜc⁶.\0\0\0█████²3ᶜb⁶.ᶜᶜ⁴\0…@@\0⁸⁶-#ᶜc⁶.リs•ᶠ⁷⁷³¹²3ᶜb⁶.ナユヲヲx98▮⁶.よ?○?\0\0らユ⁶.\0\0\0\0、?゜?⁶-#ᶜ3⁶.\0\0¹¹³³⁷⁷⁸⁶-#ᶜ6⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜb⁶.³⁷⁶ᵉᶜ、「「⁸⁶-#ᶜc⁶.`ナナららら██⁶-#ᶜ1⁶.\0\0⁸⁸⁸⁸\0\0⁸⁶-#ᶜ2⁶.「⁸\0\0\0\0\0\0⁸⁶-#ᶜ3⁶.\0\0@らら``p⁸⁶-#ᶜ6⁶.¹¹¹¹¹¹\0\0⁶-#ᶜ1⁶.³\0\0\0\0\0\0\0⁸⁶-#ᶜ2⁶.ュ◜◜ュュ◜◜◜\n⁶-#ᶜ1⁶.ナユ▒³²⁶⁶⁶⁸⁶-#ᶜ3⁶.⁷ᶠ゛、、xxx⁶-#ᶜ1⁶.³¹¹¹¹¹\0¹⁸⁶-#ᶜ3⁶.⁸☉☉っヲヲヲ`⁸⁶-#ᶜb⁶.ユpp0\0\0\0\0⁶-#ᶜ2⁶.\0\0\0\0\0ら@\0⁸⁶-#ᶜ3⁶.ナレs゛ᶠ⁷³\0⁸⁶-#ᶜ4⁶.\0\0\0\0\0 0…⁸⁶-#ᶜb⁶.。\nᶜ¹\0\0\0\0⁸⁶-#ᶜc⁶.²\0\0\0\0\0\0\0⁸⁶-#ᶜe⁶.\0\0\0\0\0\0█\0⁶-#ᶜ1⁶.██`ナら\0█ナ⁸⁶-#ᶜ2⁶.\0\0\0\0\0⁶⁶\0⁸⁶-#ᶜ3⁶.³¹\0\0\0\0\0\0⁸⁶-#ᶜ4⁶.\0\0\0\0⁸⁸⁸³⁸⁶-#ᶜ5⁶.\0@█\0 ナ`\0⁸⁶-#ᶜe⁶.\0\0\0\0\0¹¹\0⁶-#ᶜ1⁶.゜?◜ョュ◝゜ᶠ⁸⁶-#ᶜ5⁶.ナら¹²³\0`p⁶-#ᶜ1⁶.\0\0¹웃█\0\0@⁸⁶-#ᶜ5⁶.³³█\0\0███⁸⁶-#ᶜ6⁶.0000⁸「ᵉ⁶⁸⁶-#ᶜc⁶.\0\0\0\0000\0▮「²1ᶜ5⁶.▶゜\0\0ュ゜゜?⁶-#ᶜ1⁶.³³⁷⁷⁸⁷⁷▶⁸⁶-#ᶜ3⁶. ``ナら██\0⁸⁶-#ᶜ5⁶.\0\0\0\0⁷⁸「⁸⁶-#ᶜ1⁶.??>゛ᵉ⁴\0\0⁸⁶-#ᶜ3⁶.\0\0\0\0█▒▒▒⁸⁶-#ᶜc⁶.██\0\0\0\0\0\0⁶-#ᶜ3⁶.◜◜◜◜◝◝◜◜⁸⁶-#ᶜc⁶.¹\0\0\0\0\0\0\0²3ᶜb⁶.\0\0\0「,⁴⁴,⁶.ヲヲヲン…\0\0\0⁶.゜ᶠ⁷³¹\0\0\0⁶-#ᶜ3⁶.⁷⁷゜゜⁷゜゜゜⁸⁶-#ᶜb⁶.「「\0\0「\0\0\0⁸⁶-#ᶜc⁶.█\0\0\0\0\0\0\0⁶-#ᶜ1⁶.\0\0█ららナナユ⁸⁶-#ᶜ3⁶.00▮「⁸\0\0\0²1ᶜ2⁶.ュュら\0\0\0\0\0\n⁶-#ᶜ1⁶.⁴⁴\0█♥ᶠ◆⬇️⁸⁶-#ᶜ3⁶.8880800、⁶-#ᶜ1⁶.¹⁷゜⁷⁷゜ᶠ³⁸⁶-#ᶜ3⁶.\0\0\0\0\0ナユュ⁶-#ᶜ1⁶.\0\0█\0\0\0\0\0⁸⁶-#ᶜ2⁶.\0\0\0 きぬ\0\0⁸⁶-#ᶜ3⁶.\0\0\0\0\0ᶠワフ⁸⁶-#ᶜ4⁶.█☉ᶜᶜ\0\0\0\0⁸⁶-#ᶜe⁶.\0\0\0ら@@\0\0⁶-#ᶜ1⁶.ナらナら██\0\0⁸⁶-#ᶜ2⁶.\0\0\0\0⁴²\0\0⁸⁶-#ᶜ3⁶.\0\0\0\0008<゜ᶠ⁸⁶-#ᶜ4⁶.¹•	\r³¹\0\0⁸⁶-#ᶜ5⁶.\0\0\0\0\0\0█ナ⁶-#ᶜ1⁶.ᶠ⁷゜゜ᶠ⁷\0⁶⁸⁶-#ᶜ5⁶.08\0\0\0⁸⁷¹⁸⁶-#ᶜ6⁶.\0\0███ららら⁶-#ᶜ1⁶.@@ららららナナ⁸⁶-#ᶜ5⁶.██\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.▶▶⁷³ᵇ	¹⁴⁸⁶-#ᶜc⁶.⁸⁸⁸ᶜ⁴⁶⁶³²1ᶜ5⁶.○ュ\0\0\0\0\0ナ⁶-#ᶜ1⁶.」>?○○?█◝⁸⁶-#ᶜ5⁶.⁶¹\0\0\0ら○\0⁶-#ᶜ1⁶.\0\0\0\0\0█ら▒⁸⁶-#ᶜ3⁶.🐱 `D@@\0\0⁶-#ᶜ1⁶.\0\0\0ナナナら░⁸⁶-#ᶜ3⁶.◝◜◜゛、、<x²1⁶.ん◝◝ュ「スᶜ⁶⁸⁶-#ᶜb⁶.8\0\0\0\0\0\0\0²1ᶜ3⁶.◝◝◝◝ユナ \0⁶.◝◝◝◝◝ナ` ⁶-#ᶜ1⁶.\0\0\0²▮Yゃエ⁸⁶-#ᶜ3⁶.゜゜゜。ᶠ⁶⁶\0⁶-#ᶜ1⁶.ユユユユユヲヲヲ²1 \n⁶-#⁶.らら█らら@\0\0⁸⁶-#ᶜ3⁶.゜゛\0\0\0\0\0\0⁶-#ᶜ1⁶.³⁷ᶠ◆◝ヲユ\0⁸⁶-#ᶜ3⁶.ュヲユp\0\0\0\0⁶-#ᶜ1⁶.\0⁸ヲ◝゜ᶠ\0\0⁸⁶-#ᶜ3⁶.゜ワ⁷\0\0\0\0\0⁶-#ᶜ1⁶.ナモワれ⁴⁷w7⁸⁶-#ᶜ3⁶.\0¹\0\0\0\0\0\0⁸⁶-#ᶜ5⁶.\0\0\0008ユユ\0\0⁶-#ᶜ1⁶.\0¹¹¹\0\0\0\0⁸⁶-#ᶜ5⁶.³²\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.ナ`pp8「、ᶜ⁸⁶-#ᶜc⁶.\0███らナナユ⁶-#ᶜ1⁶.ナナナナナナユユ⁸⁶-#ᶜ5⁶.\0\0\0▮▮▮\0\0⁸⁶-#ᶜ6⁶.⁴⁴²²²³¹¹⁸⁶-#ᶜc⁶.³³¹¹¹\0\0\0²1ᶜ5⁶.▮「⁸「`█\0\0⁶.\0\0█ららᶠユ\0⁶-#ᶜ1⁶.██████\0³⁸⁶-#ᶜ5⁶.¹¹¹¹¹³³\0⁶-#ᶜ1⁶.\rョョメ✽ᶠ⁶\0⁸⁶-#ᶜ3⁶.ユ\0\0\0\0\0\0\0⁶-#ᶜ1⁶.そルワ◝◝ユ\0\0⁸⁶-#ᶜ3⁶.Wᵇ⁸\0\0\0\0\0⁶-#ᶜ1⁶.フcリ◝◝◝ュ\0⁸⁶-#ᶜ3⁶.「うᶜ\0\0\0\0\0⁶-#ᶜ1⁶.ᶠ█◝◝◝?⁷\0⁸⁶-#ᶜ3⁶.ユ○\0\0\0\0\0\0⁶-#ᶜ1⁶.エOエヤ~○○<⁶.ヲヲヲヲヲヲュュ²1 "
__gfx__
7777777e00000000ee7777777777e77777777777777777777777777777777777777eeee7777777777777777eeeee777777777ee0dd0e00000e77777997997777
777777e0111133bb00e77777777e0e77eeeeeee77777e777777777777eeeee7777e0000e7777777777777ee00000ee777777e00dd660677770e7777899987777
77777e01111111133b0e777777e0d0ee0000000ee77e0e7777777777e00000ee7e0dddd077777777777ee005555500e7777e0ddddd667777670e777889887777
7777e0111111111113b0e7777e00d0e0322222200ee0d0e77777777e02dddd00e0dddddd7777777777e0055555555507777e0dddddd66666660e777788877777
7777e011111110011130ee77e0dd0e034aaa942240e0d0e77777777e0222ddd00ddd555d777777777e005555dddd55577770d666ddddddddd660e77778777777
7777e01101311070113000ee0d1100344aaa9942240d10e777eee7e02112d1100dd5111d77777777e005533333b33dd7770dd666dddddddddd600e7722277777
7777e0107131107011354a0e01dd003449aa9992241150e77e000ee021121135dd51111d7777777e0055d3bbbb3333d77e0dd6ddddddd11dddd0d0e266627777
7777e010711110001135490e05d1003499999a49241510e7e00dd0ee01111335dd5111dd777777e005533bbbdd3b33d77e0d6dddddddffdd1d60d0e611167777
7777e0100155100111350eee011dd1044999aa92221510e7e0d00e77e01333555d111ddd777777e00333333d33b3ddd7e0dd6d6dd00dff001dd0dcec1c1c7777
7777e01005111011133550e7e01515044499994422110e77e000e777e0333355555555d07777ee0053b111b3333d111ee0dddd6dd0000f000dddd0ec111c7777
7777e01151000701113350e7e011150444999a942400e777e0d0e777e03333500055550e777e00003b11001b33d1001000dddd7dd294ff2901dcd0e1ccc17777
77777e01504440001133300e7e01110441144a41140e7777e000e77e03d355000005550e777e00113310440135104400d0ddd7dddfffffff01ddd0e711177777
77777e01507070001113110e77e0004441111a11140e7777e0d30eee0dd505070055550e777e01b3133049000100940e0ddd67dddfcffefe016c0e7722277777
7eee7e01500000011111310e777e044441880908840e77777e003000dd5505001d33550e777e01031330290100109207e06d67ddd5cffffe016dd0e2eee27777
e000ee01500002011111110e777e044444009940240ee77777e03300d5555001d333500e777e0000533002015010200e06ddd67ddd5f88ee0d66c0ee181e7777
01110e01500080111111110e77e000494440040024000e77777e00005555555dd335500e7777e010153100015010001e06dddd67ddd5fee0ddd6c0e881887777
01110e0115500051111111007e0f504944430002490550e77777ee0dd55555555552500077777e0011b311350001113e0616dddd76d55e01ddcc0d0818187777
11bb100111555511131311007e0f5001444400024905f0e77777e01d1155252055225000777777e0013bb333000533be0d16d1ddd6ddd011dccc0d0188817777
1bb3100111555111131111107e0ff501944430249105f0e77777e0011052550115220010777777e0055333335005533e0d16d1d1d666d115dccc00e711177777
11333111dfd1511113111110e00fff5019443044910f500e7777e0200228804108221110777777e0051551b33555d13e0d16d1551dd6dd15c66c000777777777
0111331dfddd511115511111033fff50124430491055ff007777e0022280014082211110777777e00305b11bbbdd1130016d113351dddddc6ff6cc0777777777
0111131d0d0d1111115515113330f5f000244044005fff00777e000000019100220511107777eee00305b104090411bd06dd1bbb3d11ddcc6ffff60777777777
e0111111d0d11111111155551133ff5f000220201055f03177e0110090914008205dd1107eee00e00b0531000f0010bdddd13bb31dd15dcc6fffe60777777777
7e0111115d11111111771555113305f555010001055ff0317e011d114242202205dd5330e00e00ee0001131400050010111313331dd15dccceeeec0777777777
7e0111155111111111cc11111113305555010001300003317e0d0d0d082000004dd55030e0000b0ee00103309f5500be0111d1331dd1bd0cccecc0e777777777
77e0111555511111167711111111110000110001333333117e0000e00800011d1dd50000e0bb0300e00100333350003e0331d1331d13bd50c3ee0e7777777777
7e001115055111117776111711111111111000001111111777e0e0ee0000d01dd50000d1e0330dd0000100005500000e0111dd11dd131d550bff0e7777777777
e00111500551111066601177777ccc777777777777777777777eeeeeeeeedddddddddd110001dd5d000000000000001e01111ddddd1111550b330e7777777777
00111000005111770001777777c000c77777777777777777777dddddddddddddddddddd700011155550000000555111011111111111111550bb30e7777777777
7777770990ee0ee000e777777c04450cc777777777777777777777777fffff7777777777777ffffffff777777777777fff777777777777777777777777777777
777777e090e0900aaa0e7777c004a4500cccc7777777777777777777f0000f777777777777ff000000f777777777fff000f77777777777777777777777777777
777777e0a0e09900aa0e7777c049aa4450000c77777777777777777f00000f77777777777f00000000f77777777f0007660f7777777777777777777777777777
77777e0a90e099099a0e7777c0499aa4444500c777777777777777f006600f7777777777f000c6d00f77777777f00c766d0f77ffff7777777777777777777777
7777e0aa99099999aaa0e7770c0499faa999040c777777777ff77f0067d00f777777777f0ccc7dd00f777777ff00c76ddd00ff000f7777777777777777777777
77770aa9999dddd99aaa0e770c00499aaaaa9900c7777777f00ff0067d00f777777777f00c776d00f777777f000c76dddd0000000f7777777777777777777777
77e0aaa99dd6666d99aa90e77cc0049faaaaa9050c77777f00000067d00f777777777f00cd76d00f777777f000776dd0dd500a900f7777777777777777777777
7e09a99d66667776d9a9a0e77c0500999aaaa9540c77777f044006cd00f7777777777f0cdd76d00f777777f00776d00d55505440f77777777777777777777777
7e0994d6666667776099990ec04450099faaf94000c7777f00490cd00f7777777777f007dd7dd0f7777777f0076dd00551115240f77777777777777777777777
7e094466666666776609990ec099445999ff9900490c7777f009a700f77fffff7777f0c77d7d00f7777777f006dd0d55511d2200f77777777777777777777777
e0940d666666167763d0490ec0f9944f999990499990c77f00929a00f7f0000f777f00777d6d00f77777777f00ddd55111dd51000f7777777777777777777777
e0940d66661006770130490ec0044444f99904990090c7f0092209900f00000f777f0077661d00f777777777f00055511dd5115000f777777777777777777777
e0940d666d000d770030490e0cc00044449004900090cf00922000400006600f777f0077661100f7777777777ff00011dd511150000f77777777777777777777
e0940dd6dd000d630030940e000ccc0044404900050c0f009200f0000067d00f777f00766d1100f777777777777f000dd511555ddd0077777777777777777777
7e040ddddd001d630130920e000000cc00004400540c0f0000000f00067d00f7777f00766d1100f77777777777f00000511555ddd66077777777777777777777
7e0440ddd3311d1313d0920e77700000ccc0445540c00f000000000067d00f77777f0076d11100f7777777777f00550011155dd0d66077777777777777777777
7ee0490d5533d1003350920e77770000000c04400c007fffff044006cd00f777fff000000000000f77777777f00552200555d00d666077777777777777777777
e0002290555dd100550920e7777777000000c00cc00077777f00490cd00f7777f0000000000000000077777f0055220005ddd0066c0077777777777777777777
011002220055d335002220e77777777700000cc00007777777f009a700f77777f009aaaaa9999994007777f0055220000ddd0d66c00f77777777777777777777
011000000d00737500000e777777777777700000007777777f00929a00f77777700499000000094400777f00552200ff00ddd66c00f777777777777777777777
011110000d0707000eeee777777777777777000007777777f0092209900f77777f004400444004400f77f009a2200f7f00d666000f7777777777777777777777
e00022100dd3335000e7777777777777777777777777777f00922000400f777777f0000099400000f77f00944400f777f000000ff77777777777777777777777
7ee0000220ddd350110e777777777777777777777777777f009200f000f77777777f00000000000f777f0554400f77777f0000f7777777777777777777777777
77e00404020000011420e77777777777777777777777777f00000f7fff7777777777d000445000d7777f022200f7777777ffff77777777777777777777777777
7e0024440022110124420e7777777777777777777777777f0000f777777777777777d009a95500d7777f02200f77777777777777777777777777777777777777
e00024442200101222420e7777777777777777777777777fffff7777777777777777d009aa5400d7777f0000f777777777777777777777777777777777777777
e002244222220112222200e7777777777777777777777777777777777777777777777d0009400d77777f000f7777777777777777777777777777777777777777
00224421122201112221000e7777777777777777777777777777777777777777777777d00000d777777ffff77777777777777777777777777777777777777777
00222211112201111111100077777777777777777777777777777777777777777777777d000d7777777777777777777777777777777777777777777777777777
7777777ff777777777777777777777ffff77777777777777777777777777777777777777ddd77777777777777777777777777777777777777777777777777777
777777f00ff777777777777777777f0000f777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777f00000f7777777777777777f0ff990f77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777f003000f777777777777777f094440f77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777f003bb00f7777777777777f00094000f7777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777ff033bb0f777777777777f0070000c00f777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
7777777f033300f77777777777f00d766cd00f777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
777777f0033300ff77777777777f00000000f7777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777f0008358000ff777777777fff0d10fff7777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
7777f0088885888000f7777777777f0d10f777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
777f088888851888800f77777777f00d500f77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77f0888811111122220f7777777f000d5000f7777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
7f008881881188822200f77777f000d7cd000f777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
f008888a9818888821200f777f006dc7cc1500f77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
f008289a9888888821200f77f00671ddd1c1500f7777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
f002289a8898888221200f7f00676c111cccd500f777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
f00228889888882211200f7f0076c8822eccd500f777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
f00222888888822111200ff0077c8888e286dd500f77777777777777777777777777777777777777777777777777777777777777777777777777777777777777
7f002288882222111200f7f007c7778e2226dd100f77777777777777777777777777777777777777777777777777777777777777777777777777777777777777
7f00222222221111120f77f006c77788226ddc100f77777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77f0022111111112200f77f006c77721116ddc100f77777777777777777777777777777777777777777777777777777777777777777777777777777777777777
777f00022111122000f777f006c8822116ddcc100f77777777777777777777777777777777777777777777777777777777777777777777777777777777777777
7777f00002222000ff7777f700c882111dddcc001677777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777f000000000f7777777f006c82111ddc61001677777777777777777777777777777777777777777777777777777777777777777777777777777777777777
777777ff000000f777777777d001c882ddd610011677777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777ffffff7777777777d1001cccccc100111677777777777777777777777777777777777777777777777777777777777777777777777777777777777777
7777777777777777777777777d100011110001116777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777d110000001111d7777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
777777777777777777777777777dd1111111d6677777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777dddddddd7777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
77777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777
__sfx__
000100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
000100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
000200000642003120016100000001610000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
0004000010050100500000000000217501805000000267502305025050115501555012550000000a5500755000000000000000000000000000000000000000000000000000000000000000000000000000000000
0007000001050010500f750000500275000050000500005000050050000500005000080000a0000b0000b000090000d0000000000000000000000000000000000000000000000000000000000000000000000000
000b00002155018550000000975012550207501555005550006500975016700006501475010750006500470003750037000371000610000000061000000000000000000000000000000000000000000000000000
000100002f2501a250000000a1502a250211501615007250006500000000650000000065000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
000400000642003120016100000001610000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
000100002505028050000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
000400000173000700025300070005530007000073000700007000070001700007000270000700007000070000700017000070000700007000070000700007000070000700007000070000700007000070000700
000500000b750000000475000000027500050000520145101a5201b510165100952008520335202f5201f52000000000000000000000000000000000000000000000000000000000000000000000000000000000
0002000011050160500f050100501305013000120000b00006000050000500005000080000a0000b0000b000090000d0000000000000000000000000000000000000000000000000000000000000000000000000
000800000042000000016200d70001000030100163001610016100062001710000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
000700000d02012010037500a720017500e52023010131001f0100d51000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
000200000372000010025000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
